[{"body": "Jesus, you killed it man!", "author_name": "gregmat", "utc": 1543428863.0, "replies": [["gregmat", "AbdullahBj7"]], "parent": null, "score": 6}, {"body": "Dude the choosing numbers strategy is mad. I got 3 Q sections and still dont know which one was the harder one lols. Also i did not have extensive vocabulary for verbal. I read half of prepscholar list before the test and i seriously think with more vocabulary I coulda gotten into the 160s. You hacked this test lmao", "author_name": "AbdullahBj7", "utc": 1543429330.0, "replies": [["AbdullahBj7", "gregmat"]], "parent": "gregmat", "score": 3}, {"body": "Im telling you  the choosing numbers thing works on like half the questions.", "author_name": "gregmat", "utc": 1543429671.0, "replies": [["gregmat", "twofactorial"]], "parent": "AbdullahBj7", "score": 1}, {"body": "hey there; can you elaborate on the choosing numbers strategy you are referring to?\n\n\n\n", "author_name": "twofactorial", "utc": 1543432333.0, "replies": [["twofactorial", "gregmat"]], "parent": "gregmat", "score": 1}, {"body": "To put it simply, for roughly half of the problems, you should be choosing your own numbers to either solve it, better understand it, or determine a relationship.\n\nYou can see me using the strategy on various problems on my youtube channel, specifically the solving advanced quant problems videos.", "author_name": "gregmat", "utc": 1543436718.0, "replies": [["gregmat", "twofactorial"]], "parent": "twofactorial", "score": 3}, {"body": "i see. I will definitely check them out, thanks!", "author_name": "twofactorial", "utc": 1543436861.0, "replies": null, "parent": "gregmat", "score": 1}, {"body": "this gives me faith!! i got a Q162 V152 on my 1st PP and Q157 V153 on my second. it was SO disheartening to see my score fall after i busted my ass between the two tests. I'm taking it on Dec 14th so am just having faith in the process for now i guess ", "author_name": "theoneandonlyrb", "utc": 1543430781.0, "replies": [["theoneandonlyrb", "AbdullahBj7"]], "parent": null, "score": 2}, {"body": "I would assume on the 2nd attempt you werent taking it as serious as the 1st one. Its all about mindset and focus. Do whatever it takes to make yourself 100% sharp on test day. Im a coffee junky, so what i did was bring coffee for my 10m break. I think it helped me maintain my focus throughout.  ", "author_name": "AbdullahBj7", "utc": 1543431241.0, "replies": null, "parent": "theoneandonlyrb", "score": 2}, {"body": "Great work and congrats on the result! ", "author_name": "twofactorial", "utc": 1543432349.0, "replies": [["twofactorial", "AbdullahBj7"]], "parent": null, "score": 1}, {"body": "Thank you!", "author_name": "AbdullahBj7", "utc": 1543433287.0, "replies": null, "parent": "twofactorial", "score": 1}, {"body": "Im gonna write test tomorrow in the morning and Im freaking out. I get the similar practice test scores and Im afraid of ending up with less than 300 on the actual test :((", "author_name": "Nuki93", "utc": 1543432809.0, "replies": [["Nuki93", "AbdullahBj7"]], "parent": null, "score": 1}, {"body": "1) is your fear going to help you? No. It will only make things worse. Avoid negativity and adopt positivity. Play yourself if you have to. Your unconscious mind will adapt to it and push you when you need it\n2) dont overthink it. Listen to music on your way to exam and dont surrender to the unconscious thoughts of omg imma bomb this, i forgot everything or omg Im shaking how Im gonna do it. We all face these thoughts. dismiss them quickly and try to laugh whenever possible, it will calm you \n\nGood luck!", "author_name": "AbdullahBj7", "utc": 1543433703.0, "replies": [["AbdullahBj7", "Nuki93"]], "parent": "Nuki93", "score": 2}, {"body": "This is so empowering, thanks for encouragement, Ill try my best to maintain that mindset", "author_name": "Nuki93", "utc": 1543433989.0, "replies": null, "parent": "AbdullahBj7", "score": 1}, {"body": "Ah you give me hope, I take mine friday! Congratulations!!!!", "author_name": "desolategrunt", "utc": 1543438114.0, "replies": null, "parent": null, "score": 1}]