[{"body": "At least she did the right thing, thats whats most important. I hope the twins find a good home.", "author_name": "FLTreesThrowaway", "utc": 1549277520.0, "replies": [["FLTreesThrowaway", "StandingByToStandBy"], ["FLTreesThrowaway", "failingconstantly"], ["FLTreesThrowaway", "just_want_to_lurk"], ["FLTreesThrowaway", "techleopard"], ["FLTreesThrowaway", "RussianBotTroll"]], "parent": null, "score": 571}, {"body": "Agreed 100%. Some people just can't or want to be parents. Hopefully at some point she gets her kids back, but if she's not in the frame of mind right now, then it's good the children are safe. ", "author_name": "StandingByToStandBy", "utc": 1549290700.0, "replies": [["StandingByToStandBy", "one_eyed_zoro"]], "parent": "FLTreesThrowaway", "score": 124}, {"body": "Agreed.  Just because people reproduce, don't make them capable guardians.  In nature, this just meant their kids were screwed.  Though, we never know if perhaps the next Einstein has parents that couldn't parent.  ", "author_name": "one_eyed_zoro", "utc": 1549298347.0, "replies": [["one_eyed_zoro", "tugboattomp"]], "parent": "StandingByToStandBy", "score": 36}, {"body": "Yeabut, a good percent of that Einstein is nurture. \n\nMy father's IQ is that of room temperature of an autumn afternoon but his arrogance had us all believing he was the smartest man on Earth and went on to block me at every turn, even went as far as \"knock the wind out of my sails so I wouldn't get a swelled head\" (actual experience of mine multiple times) leaving me here at nearly 60 just off a 6 year homeless stint brokedown and broke  waiting for disability, posting stupid shit anonymously to the ether somewhere on Reddit, with my only accomplishment is becoming a Minus Man ... at least by living down to his expectations, I didn't disappoint dear old Dad", "author_name": "tugboattomp", "utc": 1549311142.0, "replies": [["tugboattomp", "one_eyed_zoro"], ["tugboattomp", "Fortunate_0nesy"], ["tugboattomp", "Bigwooddeck"], ["tugboattomp", "Abomb"]], "parent": "one_eyed_zoro", "score": -19}, {"body": "To some degree yes.  Some can take it as a, \"screw you, I'll prove you wrong\" motivation. \n\nThe main thing is giving them a chance.  Though I think the biggest thing we miss in in our western society is proper mentorships for our kids.", "author_name": "one_eyed_zoro", "utc": 1549312730.0, "replies": [["one_eyed_zoro", "tugboattomp"]], "parent": "tugboattomp", "score": 9}, {"body": "Nothing worse than using a negative for motivation. That basically amounts to being abuse\n\nAll training is best when done with postive reinforcements ", "author_name": "tugboattomp", "utc": 1549331344.0, "replies": [["tugboattomp", "one_eyed_zoro"]], "parent": "one_eyed_zoro", "score": -2}, {"body": "Well, of course it's not ideal, but I think that's exaggeration.  I think of it as more of turning a negative into a reason to stay positive.  Gives you a mindset to change things rather just accepting what you have as all you can get.", "author_name": "one_eyed_zoro", "utc": 1549337450.0, "replies": null, "parent": "tugboattomp", "score": 1}, {"body": "https://www.newscientist.com/article/dn1520-iq-is-inherited-suggests-twin-study/\n\nhttps://en.m.wikipedia.org/wiki/Heritability_of_IQ\n\nhttps://www.sciencemag.org/news/2014/10/genes-dont-just-influence-your-iq-they-determine-how-well-you-do-school?r3f_986=http://www.google.com/", "author_name": "Fortunate_0nesy", "utc": 1549327593.0, "replies": null, "parent": "tugboattomp", "score": 3}, {"body": "You can nurture a tomato into a fine tomato, but can't nurture a potato into a tomato.", "author_name": "Bigwooddeck", "utc": 1549332769.0, "replies": null, "parent": "tugboattomp", "score": 1}, {"body": "I don't know why you are getting down voted for your story. ", "author_name": "Abomb", "utc": 1549332962.0, "replies": [["Abomb", "tugboattomp"]], "parent": "tugboattomp", "score": 1}, {"body": "I kno.  \n\nUnfit parents pass on anti-social and dysfunctional behavior that easily could inhibit the development of their child's brain... not to mention physical abuse which inhibits a child to develop a sense of self, along with the myriad of other problems \n\nI was emotionally abused by my mother, (having a sense her punching at me in her womb) neglected by my father, and not protected when my older brother physically abused me from age 5 to 35.\n\nI was never encouraged to stand on my own and have my own life  and my only plan was just to survive. I was too busy trying to not give into the control to have any concept of my future thereby building nothing\n\nAnd by the time I was up and out and on my own, the damaged was done, I had missed tbe boat on some many things I could have done,  but by then and still as is now I just don't have the will to care and as I've been all along struggling to survive.\n\nI was a bright kid, good grades, no drugs or booze or trouble with the law and lots of skills and interests, but no encouragement or direction to use them, only derision from my parents saying this and that were a waste of time and I would amount to nothing\n\nThere was a point one day on my own, around 25 years old when I ran out of steam, my first adult crises. \n\nBut when I reached into my planetary toolbox only to find a hammer with one claw snapped off, a rusty pair of Vise Grips and a big old paint covered screwdriver that clearly in its life was used as a chisel likely hammered with the Vise Grips \n\nSo here I was trying to rub a spark from two damp sticks while shivering in the wet woods with no elder man to give me guidance \n\nSince that day I've attempted to add what was missing only managing to amass the basic skills of a weekly paycheck which barely kept me fed, but not enough for a roof over my head, having been 1 year removed from 6 years being homeless the last 3 of which living in my car, now living in Federally subsidized housing.\n\nThe child is the father of the man...\n\nWho we are is where we're from\n\nA kind and successful classmate of mine who came from a really cool family rested his hand on my shoulder last year and said:\n\n\"Tugboat, sometimes it is not possible to overcome a bad upbringing\"\n\nNext year I'm 60, being not only broke but brokedown as well (one apparently always follows the other) there is no starting anew, it would be number 5 or 6,  so basically I am through- spending my days warehoused this way.\n\nHaving just a glimpse of my road traveled you'll agree that those who downvote me have not the perspective of my experience, and in no way could... as no one has of anyone else\n\nThank you for your comment. I read it as a kindhearted defense ^-.-^", "author_name": "tugboattomp", "utc": 1549339149.0, "replies": null, "parent": "Abomb", "score": 1}, {"body": "I hope the mom is alright. ", "author_name": "failingconstantly", "utc": 1549291544.0, "replies": null, "parent": "FLTreesThrowaway", "score": 43}, {"body": "That's the important fact.  This story could have been way, way, more horrific.", "author_name": "just_want_to_lurk", "utc": 1549324619.0, "replies": null, "parent": "FLTreesThrowaway", "score": 4}, {"body": "I fully support safe-haven laws, but does anyone know how this works if fathers don't want to surrender their rights?  Is there a way for them to find out if children get surrendered if they don't know where they were left or if the kids were left with no names?", "author_name": "techleopard", "utc": 1549344293.0, "replies": null, "parent": "FLTreesThrowaway", "score": 2}, {"body": "Could have gotten an abortion...", "author_name": "RussianBotTroll", "utc": 1549334537.0, "replies": null, "parent": "FLTreesThrowaway", "score": -3}, {"body": "[ HESPERIA  Community leaders in the High Desert on Wednesday praised the actions of a young mother who surrendered her newborn twins to a local fire station.\n\nSan Bernardino County Fire reported that at 8:39 p.m. Monday, a young female arrived at Fire Station 302 on Olive Street in Hesperia and announced she had just given birth to twins and desired to leave the babies at the station under the state's Safe-Surrender law.\n\nFire Captain Andrea Binley and her fire crew immediately took possession of the newborns and assessed their medical needs before the babies were transported by ambulance to a nearby hospital for further medical evaluation.\n\nPrior to arriving at the fire station, both infants were found clean, fed and in good medical condition. The mother refused medical attention and was provided information and instructions on how to reclaim herchildren in the event she wished to do so in accordance with the law. ...]", "author_name": "tugboattomp", "utc": 1549272569.0, "replies": [["tugboattomp", "redditninemillion"], ["tugboattomp", "BBQsauce18"], ["tugboattomp", "failingconstantly"], ["tugboattomp", "Noimnotsally"], ["tugboattomp", "orangeLILpumpkin"], ["tugboattomp", "R____I____G____H___T"]], "parent": null, "score": 304}, {"body": ">The mother... was provided information and instructions on how to reclaim herchildren in the event she wished to do so in accordance with the law.\n\n\n\"Don't lose your claim ticket.\"\n\n", "author_name": "redditninemillion", "utc": 1549287260.0, "replies": [["redditninemillion", "swishandswallow"]], "parent": "tugboattomp", "score": 196}, {"body": "\"No ticket, No Baby\"", "author_name": "swishandswallow", "utc": 1549290492.0, "replies": [["swishandswallow", "rainbowgeoff"], ["swishandswallow", "archaelleon"], ["swishandswallow", "some_random_noob"]], "parent": "redditninemillion", "score": 87}, {"body": "\"we dont do returns here. You'll need to go to the next line.\"", "author_name": "rainbowgeoff", "utc": 1549291497.0, "replies": [["rainbowgeoff", "matinthebox"]], "parent": "swishandswallow", "score": 22}, {"body": "Best we can do is one baby and only every other day. ", "author_name": "matinthebox", "utc": 1549298767.0, "replies": null, "parent": "rainbowgeoff", "score": 10}, {"body": "*Harrison Ford throws stroller out of Zeppelin*", "author_name": "archaelleon", "utc": 1549312121.0, "replies": null, "parent": "swishandswallow", "score": 7}, {"body": "that's why Indiana Jones threw her off of the Zeppelin.", "author_name": "some_random_noob", "utc": 1549312972.0, "replies": null, "parent": "swishandswallow", "score": -1}, {"body": "> The mother refused medical attention and was provided information and instructions on how to reclaim herchildren in the event she wished to do so in accordance with the law\n\nThat's good they do this.  I was wondering how that worked.   Depression is a real motherfucker, and this mom did the right thing.  Hopefully she can get her head right, and these twins grow up with a family that loves them.   ", "author_name": "BBQsauce18", "utc": 1549301417.0, "replies": [["BBQsauce18", "tugboattomp"]], "parent": "tugboattomp", "score": 58}, {"body": "Post partum depression... has led many women to infanticide ", "author_name": "tugboattomp", "utc": 1549311289.0, "replies": null, "parent": "BBQsauce18", "score": 21}, {"body": "Thank you. ", "author_name": "failingconstantly", "utc": 1549291603.0, "replies": null, "parent": "tugboattomp", "score": 7}, {"body": "I'm happy the mother was wise enough in her own heart to do the right thing for her babies,whatever her situation is,they were well cared for at the drop off,I'm sure shes overwhelmed with many thoughts and feelings right now. But the babies are safe and mom can focus on herself right now in Hope's of getting her life in order to have her family together in the future. \" mom\"If your reading this right now my sincere prayers go out to you my dear there is help available for you. Good luck, Hugs", "author_name": "Noimnotsally", "utc": 1549336623.0, "replies": null, "parent": "tugboattomp", "score": 2}, {"body": "Would a father in California be protected by the same law and be able to avoid financial responsibility for his children by dropping them off at a fire station?  Or, am I misinterpreting, and this mother is still financially liable for her children but only avoids having to provide them care by dropping them at the fire station?", "author_name": "orangeLILpumpkin", "utc": 1549297532.0, "replies": [["orangeLILpumpkin", "CaptainJ_Harkness"], ["orangeLILpumpkin", "rubyywoo"], ["orangeLILpumpkin", "janglestheclown"]], "parent": "tugboattomp", "score": -17}, {"body": "You have to have full legal custody and it needs to be within 72 hours of birth.", "author_name": "CaptainJ_Harkness", "utc": 1549297807.0, "replies": [["CaptainJ_Harkness", "periscope-suks"]], "parent": "orangeLILpumpkin", "score": 41}, {"body": ">within 72 hours of birth.\n\nThis is false, or varies by state anyway...where I live it's 30 days\n", "author_name": "periscope-suks", "utc": 1549331074.0, "replies": null, "parent": "CaptainJ_Harkness", "score": 1}, {"body": "If a father had full custody of the infant for some reason, he could drop them off at a Safe Haven space.  This is essentially surrendering the children to the state - it's the same as adoption it's just another option for someone who has perhaps struggled with the decision.  ", "author_name": "rubyywoo", "utc": 1549298311.0, "replies": [["rubyywoo", "orangeLILpumpkin"]], "parent": "orangeLILpumpkin", "score": 33}, {"body": "> If a father had full custody of the infant for some reason\n\nCan you think of a scenario where this would be legally possible within 72 hours of the child being born?\n\nThe only thing I could think of is *possibly* if the father is married to the mother and the mother dies in childbirth.  In that scenario, I think the father/husband would have default full custody without a court's involvement.  \n\nAnything else, I think it would require a court giving custody to the father.  That's unlikely to happen in 72 hours and it seems counterintuitive that a father would seek emergency court action to obtain full custody just so the child could be surrendered within 72 hours.\n\nSo basically, men have \"equal protection\" under this law in the event they decide they want to surrender their newborn while planning their wife's funeral.", "author_name": "orangeLILpumpkin", "utc": 1549299204.0, "replies": [["orangeLILpumpkin", "InfamousBLT"], ["orangeLILpumpkin", "rubyywoo"], ["orangeLILpumpkin", "Szyz"]], "parent": "rubyywoo", "score": 12}, {"body": "A bunch? And, they're all identical to how a woman might do this. Dad dies after conception or gives up custody? Woman now has sole custody and can do this. Mom dies during childbirth or gives up custody? Man now has sole custody.\n\nStop trying to make this about men and \"hurr durr what about MY rights!!\". It has nothing to do with men. It has to do with the wellbeing of the child. Period.", "author_name": "InfamousBLT", "utc": 1549305200.0, "replies": [["InfamousBLT", "Storm_cloud"]], "parent": "orangeLILpumpkin", "score": 26}, {"body": "Actually, it does have something to do with men.\n\nA woman who gives birth would have automatic custody, and can then legally abandon her children.\n\nThen, she avoids paying child support even if the father is later able to establish custody. Removing the obligation to pay  child support obviously doesn't help the well-being of a child. \n\nHowever, a man cannot do the same - he is forced to pay child support even if he never wanted the children.\n\nThat is wrong.", "author_name": "Storm_cloud", "utc": 1549309033.0, "replies": [["Storm_cloud", "InfamousBLT"], ["Storm_cloud", "Szyz"]], "parent": "InfamousBLT", "score": -15}, {"body": "A man can choose not to have sex with someone he doesn't want to have a child with. A man can choose to use contraceptives. A man has lots of choices. \n\nChild support isn't a punishment, it's to ensure care of the child. Don't want to pay child support, don't have a fucking child. Don't want to have a child, don't fuck people without wrapping it. There are real easy solutions to this \"\"\"oppression\"\"\" you're feeling. Keep your dick in your pants and you won't ever have to worry about child support. ", "author_name": "InfamousBLT", "utc": 1549312140.0, "replies": [["InfamousBLT", "Storm_cloud"], ["InfamousBLT", "orangeLILpumpkin"]], "parent": "Storm_cloud", "score": 8}, {"body": "> A man can choose not to have sex with someone he doesn't want to have a child with. A man can choose to use contraceptives. A man has lots of choices.\n\nWomen have the same choices as well.\n\nOnce a child is born, men and women should be treated equally under the law. Since a woman's bodily autonomy now has nothing to do with it. There is no justification for discriminating against fathers after a child is born.\n\n>Child support isn't a punishment, it's to ensure care of the child. \n\nIndeed. And yet, women can avoid paying child support \"to ensure care of the child\", by abandoning it. Even if the father gets custody, she won't have to pay. \n\nMen cannot do that. \n\nHow do you justify this discriminatory treatment? ", "author_name": "Storm_cloud", "utc": 1549312613.0, "replies": [["Storm_cloud", "rubyywoo"]], "parent": "InfamousBLT", "score": -1}, {"body": "I think the technical answer is that the appellate review for laws that discriminate on the basis of sex is called \"intermediate scrutiny,\" its also referred to as \"rational basis with teeth (or bite).\"  When reviewing a law under the equal protection standard of the fourteenth amendment as it concerns sex, the Court applies the intermediate scrutiny test.  To pass this test, the challenged law must: 1.) further an importantgovernment interest and 2.) must do so bymeans that are substantially related to that interest.  I haven't done much research on this, so I am not completely sure.  But this is my best guess at the moment - just some food for thought.", "author_name": "rubyywoo", "utc": 1549313297.0, "replies": null, "parent": "Storm_cloud", "score": 2}, {"body": "> Child support isn't a punishment, it's to ensure care of the child.\n\nSo then the woman in this story who abandoned her twins *will* still have to pay child support to ensure care of the children?", "author_name": "orangeLILpumpkin", "utc": 1549313015.0, "replies": [["orangeLILpumpkin", "Storm_cloud"]], "parent": "InfamousBLT", "score": -10}, {"body": "No she will not. Even if the father later gets custody, she won't have to pay. \n\nBecause women can choose to avoid paying for their kids if they don't choose to raise them by abandonment or unilateral adoption, even if the father later gets custody. Yes, women can be forced to pay child support, but only for kids that they chose to raise and then the father later gets custody (e.g. after a divorce).\n\nMen cannot choose to avoid paying for kids that they never chose to raise. \n\nClearly unjust, but people don't care about this discrimination. ", "author_name": "Storm_cloud", "utc": 1549313272.0, "replies": [["Storm_cloud", "orangeLILpumpkin"]], "parent": "orangeLILpumpkin", "score": -3}, {"body": ">  people don't care about this discrimination. \n\nHow is it discrimination if it benefits women?", "author_name": "orangeLILpumpkin", "utc": 1549313428.0, "replies": null, "parent": "Storm_cloud", "score": -5}, {"body": "If he didn't want the child, then he shouldn't have had sex with someone who wasn't a slave. You know you have no control over somebody else's body, nobody ever told you you did.", "author_name": "Szyz", "utc": 1549316938.0, "replies": [["Szyz", "Storm_cloud"]], "parent": "Storm_cloud", "score": -2}, {"body": "Your response makes no sense. It's like you people keep repeating the same  talking points like bots, even if it doesn't apply.\n\nThis has nothing to do with control over someone else's body.\n\nThe child is already born, so control over someone's body doesn't apply.\n\nAfter the child is born, a woman can avoid paying child support (even if the father gets custody later) by abandoning the child (or unilaterally adopting it out, which can and does happen).\n\nA man cannot, and is forced to pay child support.  That is wrong - women are not forced to pay for children they never chose to raise, so men shouldn't be either.\n\nObviously, this has nothing to do with control over someone's body.", "author_name": "Storm_cloud", "utc": 1549317132.0, "replies": [["Storm_cloud", "Szyz"]], "parent": "Szyz", "score": 4}, {"body": "\"You people\", ie, women?\n\nNothing to do with control over someone's body? You are complaining that women get to decide whether or not to have a baby you fathered, and that you don't get to decide that. That's because it's not your body the baby is growing in. Biology is unfair, deal with it.", "author_name": "Szyz", "utc": 1549317551.0, "replies": [["Szyz", "Storm_cloud"]], "parent": "Storm_cloud", "score": 0}, {"body": "> \"You people\", ie, women?\n\nYou people, as in the ones arguing that men should be forced to pay for kids they never consented to raise (but women shouldn't be). That somehow always repeat talking points that have nothing to do with the issue. \n\n>Nothing to do with control over someone's body? You are complaining that women get to decide whether or not to have a baby you fathered, and that you don't get to decide that.\n\nNo. I'm complaining that after birth, women can simply abandon their kids and avoid paying for it.\n\nHowever, men cannot do the same - they are forced to pay even if they never wanted the kid. Even if they were the victim of birth control sabotage or even rape, doesn't matter - still forced to pay. \n\nSeems like you're not reading what I said. My comments had nothing to do with \"someone else's body\". Like I said, this is *after* birth. ", "author_name": "Storm_cloud", "utc": 1549318029.0, "replies": null, "parent": "Szyz", "score": 8}, {"body": "Yes, I can think of a scenario where this is legally possible: if the mother surrenders custody immediately after birth and the father assumes custody, either as a decision that had been made prior to delivery or during and delivery.  This protection is available to the father if he changes his mind about accepting custody of the infant.  This is a likely scenario.  The law protects the person with legal custody of the infant for 72 hours.  \n\nEven if you look at this through a fourteenth amendment lens, as you are, the safe haven statutes likely pass the intermediate scrutiny (or rational basis \"with teeth\") test applied by the courts - the statutes 1.) further an important government interest and 2.) do so by means that are substantially related to that interest.  ", "author_name": "rubyywoo", "utc": 1549299998.0, "replies": null, "parent": "orangeLILpumpkin", "score": 11}, {"body": "So your first question was a setup, then? If you want to switch and become liable for all the growing and birthing of babies and all the discrimination and harrassment that come along wth it, be my guest.", "author_name": "Szyz", "utc": 1549316839.0, "replies": [["Szyz", "orangeLILpumpkin"]], "parent": "orangeLILpumpkin", "score": 3}, {"body": "> discrimination and harrassment\n\nYou spelt privilege wrong", "author_name": "orangeLILpumpkin", "utc": 1549318819.0, "replies": [["orangeLILpumpkin", "Szyz"]], "parent": "Szyz", "score": -3}, {"body": "Such priviledge!", "author_name": "Szyz", "utc": 1549318886.0, "replies": null, "parent": "orangeLILpumpkin", "score": 5}, {"body": "Maybe once men start giving birth we can revisit this conversation.", "author_name": "janglestheclown", "utc": 1549299740.0, "replies": [["janglestheclown", "SMTTT84"], ["janglestheclown", "Storm_cloud"]], "parent": "orangeLILpumpkin", "score": 20}, {"body": " If women want 100% of the rights then they can have 100% of the responsibility.  \n\nEDIT:  \"benefit\" was a poor word choice.", "author_name": "SMTTT84", "utc": 1549302755.0, "replies": [["SMTTT84", "sewsnap"], ["SMTTT84", "FatSputnik"]], "parent": "janglestheclown", "score": -17}, {"body": "You sound like someone who hasn't been an active participant on the raising of an infant. Going through pregnancy, birth & early infant rearing fucking sucks. It's not a \"benefit\".", "author_name": "sewsnap", "utc": 1549306730.0, "replies": [["sewsnap", "SMTTT84"], ["sewsnap", "Storm_cloud"]], "parent": "SMTTT84", "score": 18}, {"body": "I have raised two of them and as their parent I had the right to make decisions on their behalf as well as the responsibility of providing for them.  ", "author_name": "SMTTT84", "utc": 1549310336.0, "replies": [["SMTTT84", "sewsnap"], ["SMTTT84", "FatSputnik"]], "parent": "sewsnap", "score": -9}, {"body": "And yet 0 of the physical toll. Bravo for showing how completely disconnected and clueless you are.", "author_name": "sewsnap", "utc": 1549317940.0, "replies": [["sewsnap", "SMTTT84"]], "parent": "SMTTT84", "score": 5}, {"body": "> And yet 0 of the physical toll.\n\nYou call me clueless and disconnected, yet you think men have no physical toll on their bodies when it comes to children?  You think it's easy working everyday to provide for them?  How dumb do you have to be to believe that bullshit?  Or are you to have us believe that the 9 months or less that a woman carries a baby is it and then it is able to care for itself?     ", "author_name": "SMTTT84", "utc": 1549318918.0, "replies": [["SMTTT84", "sewsnap"]], "parent": "sewsnap", "score": -10}, {"body": "I'm talking about 9 months of pregnancy, the grueling sometimes deadly delivery, and the physical toll of nursing a human.\n\nSure, you might sleep a little less, be a bit more stressed. But if you think the **physical** toll you go through can really be compared. Well, you're just continuing to prove my point.\n\nAnd this isn't talking about **after the kid is born**. This is all about the inherent obligations a women has when creating a child. Because it's all on her.", "author_name": "sewsnap", "utc": 1549319771.0, "replies": [["sewsnap", "SMTTT84"]], "parent": "SMTTT84", "score": 8}, {"body": "> And this isn't talking about after the kid is born.\n\nThis article, this whole conversation is talking about something that happened AFTER the child was born.  So I'll go back to my original statement.  If women want 100% of the rights when it comes to children then they can have 100% of the responsibility.  I'm sure since you are adamant that the woman is purely responsible for children you'd be fine with men not paying child support any longer?   9 months is shit compared to 18+ years.  ", "author_name": "SMTTT84", "utc": 1549323328.0, "replies": null, "parent": "sewsnap", "score": 2}, {"body": "you are the exact example as to why women retain default rights when it comes to childrens' safety heh", "author_name": "FatSputnik", "utc": 1549317501.0, "replies": [["FatSputnik", "Storm_cloud"]], "parent": "SMTTT84", "score": 2}, {"body": "How so? What did the other person say that was unsafe or somehow wrong? \n\nAlso by your logic, a female child abuser - given that statistically, the majority of child abuse [is committed by women](http://i.imgur.com/TgBU8.png) - would be an example as to why women should not get default rights to children's safety?\n\nThat image is taken from this government source, page 39. https://www.acf.hhs.gov/sites/default/files/cb/cm2009.pdf\n\n", "author_name": "Storm_cloud", "utc": 1549329032.0, "replies": [["Storm_cloud", "FatSputnik"]], "parent": "FatSputnik", "score": 0}, {"body": "maybe you have a point\n\nif all childcare duties and responsibility was automatically transfered to men, maybe you'd all strap your shit up more and have more interest in birth control, because you'd actually suffer for it hahahah", "author_name": "FatSputnik", "utc": 1549335820.0, "replies": [["FatSputnik", "Storm_cloud"]], "parent": "Storm_cloud", "score": 2}, {"body": "Problem is that women don't want to lose the privilege of being automatically awarded child custody. Why would they? After all, if a woman doesn't want custody, she can't be forced to have it. \n\nFeminists have fought against attempts at joint custody reform for decades.", "author_name": "Storm_cloud", "utc": 1549336160.0, "replies": null, "parent": "FatSputnik", "score": 1}, {"body": "> Going through pregnancy, birth & early infant rearing fucking sucks. It's not a \"benefit\".\n\nThat isn't a benefit, true. \n\nHowever, the ability to not be forced to be a parent against your will is a major benefit. The ability to not have to pay for children (after birth) that you don't want to raise is a major benefit.\n\nLook at this example - the mother didn't want to be responsible for a child (again, after birth) so she was able to abandon her kids and her responsibility. Even if the father gets custody, she won't have to pay.\n\nBut a father who never wanted to have kids, is still forced to pay.\n\nThat's a major benefit for women. ", "author_name": "Storm_cloud", "utc": 1549328843.0, "replies": [["Storm_cloud", "sewsnap"]], "parent": "sewsnap", "score": 0}, {"body": "Uh, she still has to pay. Even in a case like this. If the legal father claims these twins, then he still gets to go after the birth mother for child support. \n\nThe only way the legal requirement of financial support is released, is if they are legally released.\n\nI've known several dads with primary or full placement who get child support from the mother. There's even grandparents/aunts/uncles who get child support for taking on a child they didn't create.\n\nPlus, there's women who never planned to get pregnant, who fall pregnant and are then expected to care for that child every single year. And even if they do figure out how to disappear after the birth (Which does happen with both mothers and fathers), it still doesn't erase the pregnancy or delivery.\n\nA man can bounce after conception and never be found again. A women can only go through abortion, and even that isn't trauma free.", "author_name": "sewsnap", "utc": 1549330023.0, "replies": [["sewsnap", "Storm_cloud"]], "parent": "Storm_cloud", "score": 1}, {"body": "> Uh, she still has to pay.\n\nNo she doesn't. There has never been a case of a woman forced to pay for a child she never chose to raise (i.e. when she abandoned it or adopted it out shortly after birth), even if the father later got custody. \n\n>I've known several dads with primary or full placement who get child support from the mother. \n\nAnd those cases would be where the mother initially raised the children, i.e. cases where the mother didn't give up the child via abandonment or adoption.\n\n>Plus, there's women who never planned to get pregnant, who fall pregnant and are then expected to care for that child every single year.\n\nExcept they are not forced to care for the child, or even give birth. They can choose to abort or adopt out or abandon.\n\n>A man can bounce after conception and never be found again.\n\nSure, if he's lucky enough to never be found. He better hope his luck  never runs out though, because the government can and will go after him for retroactive child support.\n\n\nThat doesn't change the fact that women have the ability to not be forced to be a parent against their will. And the ability to not have to pay for children (after birth) that they don't want to raise.\n\n\n", "author_name": "Storm_cloud", "utc": 1549332182.0, "replies": null, "parent": "sewsnap", "score": 0}, {"body": "don't worry, they already do", "author_name": "FatSputnik", "utc": 1549317470.0, "replies": [["FatSputnik", "SMTTT84"]], "parent": "SMTTT84", "score": 0}, {"body": "Already do what?", "author_name": "SMTTT84", "utc": 1549317672.0, "replies": null, "parent": "FatSputnik", "score": 1}, {"body": "What does giving birth have to do with it?\n\nThis is in the context of after birth.\n\nAre you saying that fathers should be treated inequally, after birth? What is your justification for that? ", "author_name": "Storm_cloud", "utc": 1549328703.0, "replies": null, "parent": "janglestheclown", "score": -1}, {"body": "> praised the actions of a young mother who surrendered her newborn twins to a local fire station.\n\nFor surviving a difficult session of giving birth at a suppossedly young age or for deciding to hand over the offspring to somebody else?", "author_name": "R____I____G____H___T", "utc": 1549295586.0, "replies": [["R____I____G____H___T", "Its_Wyenaut"], ["R____I____G____H___T", "Ingloriousfiction"], ["R____I____G____H___T", "Nissir"], ["R____I____G____H___T", "Squirmingbaby"], ["R____I____G____H___T", "LIGHT_COLLUSION"], ["R____I____G____H___T", "sewsnap"]], "parent": "tugboattomp", "score": -34}, {"body": "I understand how you could see this as a negative but from any political angle this is a win if you want it to be. \n\nThis wasn't a prom night dumpster baby. It's not a back alley abortion. It's a girl recognizing that she's in way over her head with this. Hopefully these babies will find a good home that will take both of them. Or we'll get an excellent Murray show out of it 20 years from now. ", "author_name": "Its_Wyenaut", "utc": 1549298485.0, "replies": null, "parent": "R____I____G____H___T", "score": 23}, {"body": "Probably praising this decision vs. the alternative", "author_name": "Ingloriousfiction", "utc": 1549297892.0, "replies": null, "parent": "R____I____G____H___T", "score": 15}, {"body": "I think that the making of such a hard decision deserves recognition.  ", "author_name": "Nissir", "utc": 1549296890.0, "replies": [["Nissir", "[deleted]56224986"]], "parent": "R____I____G____H___T", "score": 37}, {"body": "I don't think so. I think she did well in making sure they weren't in danger, but that's the only good deed here, not the act of leaving them itself. No amount of sympathy for the mother, regardless of how difficult her situation may legitimately be, will allow me to pretend that abandoning one's children is a virtuous act. It's good she didn't leave them in the street, but that's a pretty low bar to meet and I'm not going to praise the act of leaving them itself.\n\nEdit: Downvotes won't change my mind. Discussion might, if somebody can present a compelling argument to convince me I'm wrong.", "author_name": "[deleted]56224986", "utc": 1549301031.0, "replies": [["[deleted]56224986", "sewsnap"], ["[deleted]56224986", "lifeonthegrid"], ["[deleted]56224986", "JennJayBee"]], "parent": "Nissir", "score": -37}, {"body": "You mean, putting them up for adoption? Because that's what she did here. She didn't \"abandon\" them. She brought them to a safe place where they can find loving parents.\n\nWTF is wrong with you?", "author_name": "sewsnap", "utc": 1549306556.0, "replies": [["sewsnap", "[deleted]287416173"]], "parent": "[deleted]56224986", "score": 22}, {"body": "I'll ignore the second part, but the first part is good food for thought. It raises a lot of questions that I have to actually think through, like, \"Is there a meaningful difference between this act and adoption?\" and, \"is the act of putting up a child for adoption inherently a morally virtuous act?\"\n\nAs for the first question, I think you're correct, and the distinctions between this and adoption are only formalities. It's two different forms of introducing the children to the state-care system, but from there I expect the routes are largely the same.\n\nAs for the second question: no, I don't think that putting children up for adoption is *inherently* a virtuous act. That is not the same thing as condemning it as evil, however, just like what I said above was not intended to condemn the mother, but I realize how it could be interpreted that way. So let me clarify.\n\nI don't think the act of putting a child up for adoption automatically deserves praise, but that is not the same thing as saying it automatically deserves condemnation. I recognize that adoption is almost always the product of difficult circumstances, and I recognize that it is usually an attempt to help the child live a better life than it otherwise would. But it by no means guarantees a wonderful (or even better) life for the child, and for that reason I can't praise it, and I don't understand the reflexive desire to.\n\nIs it better than abandoning the child in an unsafe place, like in a dumpster or on the street? Absolutely.\n\nIs it better than raising the child yourself, despite the difficult circumstances? Impossible to say, even on a case-by-case basis. You don't know that the child will be adopted; for all you know it will languish in foster care, and there's a non-negligible chance that it will become the victim of sexual and/or physical abuse. Putting a child up for adoption doesn't guarantee it a better life than the one you can provide, even if the one you can provide seems guaranteed to be awful.\n\nI don't condemn this mother. I simply refuse to praise her, and I don't see that my refusal is as reprehensible as you all seem to think. ", "author_name": "[deleted]287416173", "utc": 1549308180.0, "replies": [["[deleted]287416173", "sewsnap"]], "parent": "sewsnap", "score": -18}, {"body": "She's saying, hey, I can't mom these kids, I want my kids to have an actual chance. So she chose to **give them an actual shot**.\n\nIt could be that she was hiding the pregnancy. She could be destitute and not able to afford 2 children. She could be being abused. She could have mental issues. She could have been raped. There's a ton of reasons she chose to give her kids better odds. \n\nWhy did she go this route? Because it's anonymous. Because she can go through this route if she's being abused by a parent or partner. Because it's **safe**. It's also really really quick. The formal process of adoption isn't quick, and it's complicated.", "author_name": "sewsnap", "utc": 1549308978.0, "replies": [["sewsnap", "[deleted]93615980"]], "parent": "[deleted]287416173", "score": 19}, {"body": "Did you actually read my full comment, or did you skim it? This doesn't address my point. I already conceded that this isn't morally different than adoption. The route of introduction doesn't concern me. \n\nI also conceded that I realize that the act of putting them up for adoption usually signifies that the mother doesn't think she can provide them with a decent life. I get that, and it's the reason I don't condemn her for it. Honestly, she's probably homeless and may not even know how to feed these children. That doesn't change what I'm saying.\n\n*I'm not even saying she made the wrong decision,* which is what you seem to have taken away from my comment.\n\nWhat I *am* saying is that she made a difficult decision, a very difficult decision, and the reason it's *difficult in the first place* is because it isn't obvious at all which avenue is better: giving them up to the potential chaos of the state-care system, or raising them in the (let's say \"guaranteed\") chaos of her own life.\n\nOne of the main reasons it's such a hard decision in the first place is because neither option is **obviously** better. And because neither option is obviously better, I can't assume she chose the correct one, so I can't automatically praise her. Meaning that my response would be the same even if she had chosen to keep the children and raise them herself. I don't know which route is better. And because I don't know which route is better, I'm not going to praise her reflexively for choosing either one of them.\n\nI'm not condemning her. I'm just also not praising her, and I don't think that such praise should be automatic, because the situation is too complicated to warrant that response for either decision. \n\nEDIT: So, to clarify:\n\nAttitudes this young mother deserves from us:\n\n-Respect of the choice she made, because only the individuals in these situations should be able to make that choice. And by respecting the choice, I mean she of course should not be forced to keep the children, and an attempt should be made by the state to give them as good of a life as possible.\n\n-Sympathy for being in such a difficult situation in the first place that she was faced with the decision of giving up her children.\n\nAttitudes she doesn't deserve:\n\n-Automatic praise.\n\n-Automatic condemnation.", "author_name": "[deleted]93615980", "utc": 1549310197.0, "replies": [["[deleted]93615980", "sewsnap"]], "parent": "sewsnap", "score": -9}, {"body": "Dude, get over yourself. I read it, and figured you just don't understand why we're proud of her. Tried to make it easier for you to comprehend.\n\nWrite me another novel though, and I'm flat out ignoring it. Like I'm doing with that^.", "author_name": "sewsnap", "utc": 1549317880.0, "replies": null, "parent": "[deleted]93615980", "score": 7}, {"body": "You suck. ", "author_name": "lifeonthegrid", "utc": 1549303335.0, "replies": [["lifeonthegrid", "[deleted]825660640"]], "parent": "[deleted]56224986", "score": 12}, {"body": "Very compelling.", "author_name": "[deleted]825660640", "utc": 1549305562.0, "replies": [["[deleted]825660640", "lifeonthegrid"]], "parent": "lifeonthegrid", "score": -9}, {"body": "Wasn't the goal. ", "author_name": "lifeonthegrid", "utc": 1549305815.0, "replies": null, "parent": "[deleted]825660640", "score": 12}, {"body": "Well, let's look at the other options:\n\n1. abortion\n\n2. a likely incapable parent raising two children in an unstable environment-- at best.\n\nShe did what was best for the babies, including using her own body as a living incubator for 9 months while she carried two babies she'd eventually give up. That's pretty selfless. If she'd wanted to keep them, then the fact that her priority was making sure they had a good home and were healthy makes the act all the more selfless.  She put their needs ahead of her own wants.\n\nUnder no circumstances is forcing a child to be raised by a parent who can't or won't provide for them ever the best thing for that child. Lots of people can have babies. Not everyone can be a parent. Unless there's some sick desire to punish someone for getting pregnant (which would by extension punish the innocent child), I can't see how someone could look at this and have contempt.", "author_name": "JennJayBee", "utc": 1549313280.0, "replies": [["JennJayBee", "[deleted]437272514"]], "parent": "[deleted]56224986", "score": 6}, {"body": "Thank you for the response. From my comment below:\n\nAttitudes this young mother deserves from us:\n\n-Respect of the choice she made, because only the individuals in these situations should be able to make that choice. And by respecting the choice, I mean she of course should not be forced to keep the children, and an attempt should be made by the state to give them as good of a life as possible.\n\n-Sympathy for being in such a difficult situation in the first place that she was faced with the decision of giving up her children.\n\nAttitudes she doesn't deserve:\n\n-Automatic praise.\n\n-Automatic condemnation.\n\nI think it's a tough enough decision that neither choice should be met with automatic praise. Reading my original comment makes me realize I worded it poorly, and it comes off as a harsher condemnation than was intended. I don't condemn this mother, I just can't find it in me to praise her as an automatic response to her decision. In fact I find the praise weird, because the children are going to be in an unstable environment no matter what. ", "author_name": "[deleted]437272514", "utc": 1549314073.0, "replies": null, "parent": "JennJayBee", "score": 0}, {"body": "For being brave enough to give the kids a chance at life. ", "author_name": "Squirmingbaby", "utc": 1549297044.0, "replies": null, "parent": "R____I____G____H___T", "score": 23}, {"body": "Por que no los dos?", "author_name": "LIGHT_COLLUSION", "utc": 1549295659.0, "replies": null, "parent": "R____I____G____H___T", "score": 8}, {"body": "Probably both. They both deserve praise. ", "author_name": "sewsnap", "utc": 1549306490.0, "replies": null, "parent": "R____I____G____H___T", "score": 2}, {"body": "Good, at least they have a shot.", "author_name": "mrmidnight89", "utc": 1549275112.0, "replies": null, "parent": null, "score": 109}, {"body": "Bully for her. Hard moment for anyone, making the right decision in all that fog is an achievement alone. ", "author_name": "Silentmooses", "utc": 1549281438.0, "replies": [["Silentmooses", "CAESTULA"]], "parent": null, "score": 151}, {"body": ">Bully for her.\n\nNeed to bring this back. Theodore Roosevelt was a goddamn hero. ", "author_name": "CAESTULA", "utc": 1549286512.0, "replies": [["CAESTULA", "Silentmooses"], ["CAESTULA", "TheodoreFMRoosevelt"], ["CAESTULA", "jimmyco2008"]], "parent": "Silentmooses", "score": 58}, {"body": "My thoughts exactly ", "author_name": "Silentmooses", "utc": 1549286537.0, "replies": null, "parent": "CAESTULA", "score": 11}, {"body": "I'll be back soon as I find a stick big enough for the job.", "author_name": "TheodoreFMRoosevelt", "utc": 1549294848.0, "replies": [["TheodoreFMRoosevelt", "TheHeadGoon"]], "parent": "CAESTULA", "score": 16}, {"body": "/r/beetlejuicing ?", "author_name": "TheHeadGoon", "utc": 1549298842.0, "replies": null, "parent": "TheodoreFMRoosevelt", "score": 4}, {"body": "Please and thank you ", "author_name": "jimmyco2008", "utc": 1549346511.0, "replies": null, "parent": "CAESTULA", "score": 1}, {"body": "I grew up in a home with a single mother who essentially hated me for embodying her greatest mistake in marrying my estranged father. Killed or attacked pets; destroyed everything I owned; worked me since 12 and took my checks; took credit cards out in my name; etc. Any childish mistake or blunder of learning I made was viewed as a personal attack on her rearing and motherhood. \n\nWas homeless in Chicago before I even finished high school. Whenever a story comes up like this I wonder how different it all could have been if she just accepted she wasnt capable of being a mother to me. \n\nI have some friends who grew up in foster, one whos life was equally horrific to mine, so its not like its always a grass-is-greener situation, yet I still cant prevent myself from wondering.", "author_name": "Piperplays", "utc": 1549297790.0, "replies": [["Piperplays", "tugboattomp"], ["Piperplays", "spanner79"]], "parent": null, "score": 94}, {"body": "My mother turned out to be seriously mentally ill only the kind that is hidden from view and was completely unqualified and ill equipped to be a mother and raise children.\n\nWith the help of my father they totally fucked up the 4 of us though now that they're elderly they proclaim they were good parents and blame us for not listening enough \n\nWhich is why I never had children, as well as my 2 sisters and my brother had 1 but then she divorced his broken ass and left for cross country, as far as possible from this fucked up family never to be heard from again (tho my niece's social media shows a troubled girl  but one who is trying)\n\nI certainly wasn't going to pass our mental illness gene to an unsuspecting child, and there was no way I was going to give my batshit crazy parents any grandchildren to fuck up as well", "author_name": "tugboattomp", "utc": 1549312061.0, "replies": null, "parent": "Piperplays", "score": 15}, {"body": "If she would have surrendered you at birth you would have been adopted by someone who wanted you.  ", "author_name": "spanner79", "utc": 1549300276.0, "replies": [["spanner79", "51626685126387340"]], "parent": "Piperplays", "score": 23}, {"body": "Except that not all get adopted. \n\nEdit: maybe I'm wrong. I hope I am wrong.", "author_name": "51626685126387340", "utc": 1549302561.0, "replies": [["51626685126387340", "Underwater_Karma"], ["51626685126387340", "spanner79"]], "parent": "spanner79", "score": 26}, {"body": "there's years long waiting lists to adopt babies.  ", "author_name": "Underwater_Karma", "utc": 1549302641.0, "replies": [["Underwater_Karma", "Gunkspargle"]], "parent": "51626685126387340", "score": 27}, {"body": "Those are usually for ones adopted fresh out of the vagina/c-section though. It seems like the door is still open for Mum to reclaim them so they are likely in foster care.", "author_name": "Gunkspargle", "utc": 1549307645.0, "replies": [["Gunkspargle", "Szyz"], ["Gunkspargle", "techleopard"]], "parent": "Underwater_Karma", "score": 13}, {"body": "Still, as newborns they are incredibly desirable.", "author_name": "Szyz", "utc": 1549317099.0, "replies": null, "parent": "Gunkspargle", "score": 3}, {"body": "This is actually one of the biggest factors that drives a lot of adopters away, I think.\n\nWhen people say it's \"easier\" to adopt over-seas, what they are saying is, they can go overseas and get a baby or child and it's *theirs*, the end, end of story.\n\nIn the US, you can adopt a child and then spend 10 years in constant court battles just trying to get the birth parents to leave you the fuck alone, and always trying to re-insert themselves into the life of the child (regardless of whether that's healthy or not).  There have been cases where adoptions have been reversed, and it just leaves families with a lot of heartache and debt.\n\nWe need to pick a point where parental rights are just gone.  There shouldn't be an \"undo\" button after a reasonable wait period if you sign your kids away (say, 3-4 months), and if you lose your kids due to child abuse, that should be it.  ", "author_name": "techleopard", "utc": 1549344748.0, "replies": null, "parent": "Gunkspargle", "score": 2}, {"body": "There is a massive waiting list for newborn babies for adoption, especially healthy non-special needs babies.  Biggest issue if you keep them in the system trying to get reunited with their mother and that doesn't work out it greatly decreases the chance of them ever being adopted. ", "author_name": "spanner79", "utc": 1549302901.0, "replies": [["spanner79", "techleopard"]], "parent": "51626685126387340", "score": 20}, {"body": "Yeah.  I think this is something we need to address in our society.  Nobody wants to be accused of \"ripping children out of the arms of mothers\" or what-have-you, but at some point we need to draw a line.  We literally can't find enough people willing to adopt children in this country, and many of the ones that are open to it don't want to adopt in the US because of our legal system.", "author_name": "techleopard", "utc": 1549345159.0, "replies": null, "parent": "spanner79", "score": 1}, {"body": "This, too is the freedom to choose.\n\n(And that's a good thing.)", "author_name": "va_wanderer", "utc": 1549296095.0, "replies": null, "parent": null, "score": 22}, {"body": "I would rather her do that than leave a newborn baby on a lawn covered in ants. Happened in Houston about 6 months ago.", "author_name": "drew1111", "utc": 1549302990.0, "replies": [["drew1111", "HorAshow"]], "parent": null, "score": 18}, {"body": "thank you for this\n\nI needed a reason to get off reddit for the day\n\nthanks again", "author_name": "HorAshow", "utc": 1549304674.0, "replies": null, "parent": "drew1111", "score": 10}, {"body": "I imagine having twins would be a nightmare for a single parent the cost of daycare. The fact every time one kid would stop crying the other one would start cant blame her at all. ", "author_name": "Steelcity1995", "utc": 1549292969.0, "replies": [["Steelcity1995", "Lostallthefucksigive"]], "parent": null, "score": 35}, {"body": "My sister and her husband have 6 month old twins. The amount of energy it takes to keep up with them is incredible. My mom moved in for the first 4 months to be a third set of hands. For a single mother, I couldnt imagine how exhausting and impossible raising twins would feel. ", "author_name": "Lostallthefucksigive", "utc": 1549299593.0, "replies": [["Lostallthefucksigive", "ignenrintegra"], ["Lostallthefucksigive", "techleopard"]], "parent": "Steelcity1995", "score": 32}, {"body": "My neighbor has triplets. He says that if you have 1 baby, you get 6 hours of sleep per night. If you have 2 babies, you get 4 hours of sleep per night. If you have 3 babies, you get 2 hours of sleep per night. I don't want to think about what happens to higher order multiples.", "author_name": "ignenrintegra", "utc": 1549306821.0, "replies": [["ignenrintegra", "haystackthecat"], ["ignenrintegra", "WestCoastBestCoast01"]], "parent": "Lostallthefucksigive", "score": 8}, {"body": "I think you'd be lucky to get 6 hours of sleep per night in the first few months. You might get that if you and your partner are sharing the handling of feedings, but otherwise, if you're a single mom, no way.  Many newborns wake up to be fed about every 2 hours, and it takes about 15-30 minutes to feed them, another 15-30 to burp them and get them back to sleep, and then you have to try to fall asleep yourself, which may not happen instantly.  Then, they'll be awake again in about 2 hours from the time the last round started. Insane.  I don't know how single parents or multiple birth parents do it without extra help.   ", "author_name": "haystackthecat", "utc": 1549321025.0, "replies": [["haystackthecat", "techleopard"]], "parent": "ignenrintegra", "score": 4}, {"body": "And to think, maternity leave still isn't a valued right in the US.  :/\n\nEven if you don't care about some mom bonding with her newborn, just think of it like this:  That mom that just spent the last 4 weeks doing nothing but feeding her baby on a 2 hour schedule is now getting behind the wheel of a 2,000 pound death machine in rush hour traffic to go to her job where she files your taxes, fills your medication, or any other number of things that likely affects you.", "author_name": "techleopard", "utc": 1549345575.0, "replies": null, "parent": "haystackthecat", "score": 1}, {"body": "I feel like after three you start to get economies of scale going. ", "author_name": "WestCoastBestCoast01", "utc": 1549320980.0, "replies": null, "parent": "ignenrintegra", "score": 1}, {"body": "\"It takes a village.\"\n\nThe 'nuclear family' household that we have in the US that is comprised of JUST parents and their minor-age children is actually a very new concept.  Historically, multi-generational households have always been a thing and still *are* a thing in other parts of the world.  And this is one of the reasons why.\n\nWe make ourselves miserable in the name of independence but sometimes you have to realize you just can't do it all.", "author_name": "techleopard", "utc": 1549345332.0, "replies": null, "parent": "Lostallthefucksigive", "score": 1}, {"body": "Thank goodness (and sensible law) she had that option! ", "author_name": "SS_Upboat", "utc": 1549306965.0, "replies": null, "parent": null, "score": 7}, {"body": "...ok? We have safe surrender laws, people use them. Why is this being posted as news?", "author_name": "WeAreGonnaBang", "utc": 1549283124.0, "replies": [["WeAreGonnaBang", "ShimmyZmizz"], ["WeAreGonnaBang", "Sun_Djinn_Kari"], ["WeAreGonnaBang", "PhilipLiptonSchrute"], ["WeAreGonnaBang", "Rosebunse"], ["WeAreGonnaBang", "rubyywoo"], ["WeAreGonnaBang", "ascpl"], ["WeAreGonnaBang", "RadioOperatorMan"], ["WeAreGonnaBang", "Thumpd2"], ["WeAreGonnaBang", "MySweetBitch"], ["WeAreGonnaBang", "SS_Upboat"], ["WeAreGonnaBang", "Szyz"], ["WeAreGonnaBang", "Digiman1"], ["WeAreGonnaBang", "easwaran"], ["WeAreGonnaBang", "failingconstantly"], ["WeAreGonnaBang", "titlewhore"], ["WeAreGonnaBang", "Dustin_00"], ["WeAreGonnaBang", "urgoingdownbitch01"]], "parent": null, "score": 139}, {"body": "Probably so that people who might consider abandoning a baby in the future might hear about it. Like a PSA. Also twins are not common and are probably worth a few bonus clicks.", "author_name": "ShimmyZmizz", "utc": 1549283548.0, "replies": [["ShimmyZmizz", "Bookandaglassofwine"]], "parent": "WeAreGonnaBang", "score": 238}, {"body": "You nailed it, it is like a PSA.\n\nBut that's not what \"news\" should be, at least ideally.", "author_name": "Bookandaglassofwine", "utc": 1549297279.0, "replies": [["Bookandaglassofwine", "meat_tunnel"]], "parent": "ShimmyZmizz", "score": 6}, {"body": "News shouldn't be a PSA?  In what world?", "author_name": "meat_tunnel", "utc": 1549302698.0, "replies": [["meat_tunnel", "Bookandaglassofwine"]], "parent": "Bookandaglassofwine", "score": 24}, {"body": "You are implying that news should be propaganda to help mold public opinion, not just inform it.  Think about that for a moment.", "author_name": "Bookandaglassofwine", "utc": 1549303378.0, "replies": [["Bookandaglassofwine", "TerrytheMerry"], ["Bookandaglassofwine", "ShimmyZmizz"]], "parent": "meat_tunnel", "score": -15}, {"body": "PSAs are public safety announcements, they contain facts not opinions. It is a fact that abandoning a child at a fire station is an option for someone looking to not keep a baby. It is an opinion that such a person shouldnt have kept the pregnancy or gotten pregnant to begin with. ", "author_name": "TerrytheMerry", "utc": 1549304980.0, "replies": [["TerrytheMerry", "TucuReborn"], ["TerrytheMerry", "YWxpYXMw"]], "parent": "Bookandaglassofwine", "score": 13}, {"body": "\"Public Service Announcement\". Close though. They exist as a manner of informing the public, and often do include safety. News is basically a giant PSA that may or may not have opinions thrown in.  ", "author_name": "TucuReborn", "utc": 1549313673.0, "replies": null, "parent": "TerrytheMerry", "score": 6}, {"body": "Not all PSA's carry facts, and are built heavily on emotion and fear, and not just fact. ", "author_name": "YWxpYXMw", "utc": 1549308176.0, "replies": [["YWxpYXMw", "TerrytheMerry"]], "parent": "TerrytheMerry", "score": -5}, {"body": "Youre confusing campaign ads with PSAs. Campaign ads arent exclusive to politics there are anti-abortions campaigns, drug legalization campaigns etc., which is what you are thinking of. ", "author_name": "TerrytheMerry", "utc": 1549308437.0, "replies": [["TerrytheMerry", "YWxpYXMw"]], "parent": "YWxpYXMw", "score": 9}, {"body": "I know the difference between the 2. The most recognized PSA...this is your brain, and this is your brain on drugs.\n\nhttps://en.m.wikipedia.org/wiki/This_Is_Your_Brain_on_Drugs", "author_name": "YWxpYXMw", "utc": 1549308750.0, "replies": [["YWxpYXMw", "TerrytheMerry"], ["YWxpYXMw", "Misguidedvision"]], "parent": "TerrytheMerry", "score": -5}, {"body": "Dude the very first line of that article refers to it as a large scale campaign. It was a campaign not a PSA. ", "author_name": "TerrytheMerry", "utc": 1549326094.0, "replies": null, "parent": "YWxpYXMw", "score": 2}, {"body": "I would agree with you tbh, this isn't really news and PSAs have been used to spread misinformation and propaganda for years\n\nEdit: can't refute the argument, let the downvotes commence. ", "author_name": "Misguidedvision", "utc": 1549322123.0, "replies": null, "parent": "YWxpYXMw", "score": -1}, {"body": "Thought about it for a bit, honestly feels like a bit of an overreaction in this specific case, and there's situations in which molding public opinion absolutely should be part of the news:\n\n\"There's a dangerous hurricane approaching, but we won't advise you on whether you should evacuate or not; that would be propaganda, and it's not our job to mold public opinion.\"\n\nObviously an exaggeration, but if PSAs are newsworthy for matters of public safety, it's not a huge leap to see this article as something similar on a much smaller scale.", "author_name": "ShimmyZmizz", "utc": 1549308627.0, "replies": null, "parent": "Bookandaglassofwine", "score": 3}, {"body": "Believe it or not a lot of people are unaware that safe surrender exists, or if they are aware, are unaware of how it works. Personally hearing this story is great, because they will likely grow up with good opportunities instead of having their lives snuffed out by poor choices or because they werent aborted.", "author_name": "Sun_Djinn_Kari", "utc": 1549287438.0, "replies": [["Sun_Djinn_Kari", "Rosebunse"]], "parent": "WeAreGonnaBang", "score": 108}, {"body": "I'm pro-choice, but I think Safe Haven places are something we all can appreciate. Lots of women might not want an abortion or they might not be able to get an abortion, or they might not be able to adopt them out sooner.", "author_name": "Rosebunse", "utc": 1549292342.0, "replies": [["Rosebunse", "Zack_Wester"]], "parent": "Sun_Djinn_Kari", "score": 38}, {"body": "I can't personally stand the pro life crowd.  \noh to poor or young to have kids and got pregnant (rape maybe) no you shall birth thou holy child... help no begone peasant put thoe new born in a reef raft and let it sail down the river.  \n  \n((read In old English on phone so a bit hard to get it correctly)).   \nthe pro life don't care about the child after birth.  \ndiscussing cowards all of them.\n\nwish I was in the us so that I could send a letter whit my thoughts to all the major newspaper to be\nprinted.  \n//sorry for my English Swedish and on the phone.", "author_name": "Zack_Wester", "utc": 1549297407.0, "replies": [["Zack_Wester", "Sun_Djinn_Kari"], ["Zack_Wester", "Pseuzq"]], "parent": "Rosebunse", "score": 8}, {"body": "Safe surrender is the pro life option in lieu of abortion. ", "author_name": "Sun_Djinn_Kari", "utc": 1549305133.0, "replies": null, "parent": "Zack_Wester", "score": 4}, {"body": "No prob on the language. Message received.", "author_name": "Pseuzq", "utc": 1549300488.0, "replies": null, "parent": "Zack_Wester", "score": 2}, {"body": "To hopefully encourage other soon-to-be mothers not to throw their babies in the trash. ", "author_name": "PhilipLiptonSchrute", "utc": 1549287268.0, "replies": null, "parent": "WeAreGonnaBang", "score": 57}, {"body": "I think this news article was helpful to women who might be thinking of using something like this. The article praised the mother for  bringing the kids to the firestation and it pointed out that she could even legally reclaim them under the right circumstances.", "author_name": "Rosebunse", "utc": 1549292225.0, "replies": null, "parent": "WeAreGonnaBang", "score": 18}, {"body": "I think some positive coverage on this is a good thing.  It lets people know about the law and the positive coverage lets parents know this is an option.  You're certainly right that it shouldn't be newsworthy every time it happens, but I think some positive coverage can help people who are really struggling.  ", "author_name": "rubyywoo", "utc": 1549300322.0, "replies": null, "parent": "WeAreGonnaBang", "score": 6}, {"body": "I mean, it's better than news about Sponge Bob at the half-time show", "author_name": "ascpl", "utc": 1549291650.0, "replies": null, "parent": "WeAreGonnaBang", "score": 7}, {"body": "The question youre asking is why is this newsworthy? The answer is that its novel (twins), emotional, and could be seen as part of the overall conflict regarding birthing rights. Its a very easy thing to spot as a journalist which Ive now assumed you arent.\n\nAnyways, thats why its in the news!", "author_name": "RadioOperatorMan", "utc": 1549284969.0, "replies": [["RadioOperatorMan", "berberine"]], "parent": "WeAreGonnaBang", "score": 29}, {"body": "Can confirm. I am a reporter and would have jumped at this story, taking care to not name the mother or describe her appearance. This is a story and it raises awareness to other mothers that this is an option rather than abandoning the child(ren) in some unsafe location.", "author_name": "berberine", "utc": 1549289135.0, "replies": [["berberine", "ToplessNedFlanders"]], "parent": "RadioOperatorMan", "score": 33}, {"body": "I'm a firefighter and have never seen example of someone using this safe surrender situation/law.  I'd want to see this as a news story, too.", "author_name": "ToplessNedFlanders", "utc": 1549291309.0, "replies": [["ToplessNedFlanders", "BannedfromGreece"]], "parent": "berberine", "score": 27}, {"body": "I'm a fire-reporterologist and I too would write or like to see this in the daily news.", "author_name": "BannedfromGreece", "utc": 1549295502.0, "replies": [["BannedfromGreece", "kremes"]], "parent": "ToplessNedFlanders", "score": 7}, {"body": "Careful making up titles like that, CNN will try to get you on as an expert.", "author_name": "kremes", "utc": 1549333150.0, "replies": null, "parent": "BannedfromGreece", "score": 1}, {"body": "I'm assuming not everyone knows. I didn't know, and those also don't exist in that form where I live.", "author_name": "Thumpd2", "utc": 1549295360.0, "replies": null, "parent": "WeAreGonnaBang", "score": 5}, {"body": "Maybe so that other people continue to be reminded of these available laws that you so clearly are already an expert on?", "author_name": "MySweetBitch", "utc": 1549300775.0, "replies": null, "parent": "WeAreGonnaBang", "score": 3}, {"body": "because it's good news and lets people know this is a thing.", "author_name": "SS_Upboat", "utc": 1549307170.0, "replies": null, "parent": "WeAreGonnaBang", "score": 2}, {"body": "To advertise safe surrender laws, and that they really do let you hand over the baby.", "author_name": "Szyz", "utc": 1549317157.0, "replies": null, "parent": "WeAreGonnaBang", "score": 2}, {"body": "Shouldn't we use some sort of confidentiality in these cases? If anything, this story gaining coverage will deter others just by the headline. Oi", "author_name": "Digiman1", "utc": 1549283493.0, "replies": [["Digiman1", "hexiron"]], "parent": "WeAreGonnaBang", "score": 7}, {"body": "They didn't announce the woman's name and kept her anonymous, they called her brave and applauded her wise choices, and outlined why her choices were a viable and safe method for other mother's to surrender their children if necessary. I don't see why this would deter other people from utilizing this resource and it's a good thing it is publicized so others know it's an option. ", "author_name": "hexiron", "utc": 1549284694.0, "replies": null, "parent": "Digiman1", "score": 46}, {"body": "I think a lot of this sub is weird one-off stories about good or bad parents. I would prefer it only to include news stories that affect people in many parts of the world, but if people want their human interest stories, they can find them here. ", "author_name": "easwaran", "utc": 1549313343.0, "replies": null, "parent": "WeAreGonnaBang", "score": 1}, {"body": "What exactly is news worthy in your opinion? ", "author_name": "failingconstantly", "utc": 1549291725.0, "replies": [["failingconstantly", "easwaran"]], "parent": "WeAreGonnaBang", "score": 1}, {"body": "Something that affects multiple people. When its a general Reddit news thread, it should ideally affect people in many different parts of the world. ", "author_name": "easwaran", "utc": 1549313284.0, "replies": null, "parent": "failingconstantly", "score": 0}, {"body": "because yesterday was the super bowl and they didn't have shit to report so they grabbed the first story that jumped out at them. ", "author_name": "titlewhore", "utc": 1549321390.0, "replies": null, "parent": "WeAreGonnaBang", "score": 0}, {"body": "It was more fun when the father of 9 ditched all his kids...\n\n[Wait -- he's got twins now?!!!??? Oh, lawdy!](https://www.foxnews.com/story/father-who-ditched-nine-kids-via-safe-haven-law-has-twins-on-the-way)\n\nGranted, yeah, I don't know how a suddenly single parent handles 9 kids... but if you find a new partner, it kinda feels like you should go recover your other kids before having more.", "author_name": "Dustin_00", "utc": 1549298711.0, "replies": null, "parent": "WeAreGonnaBang", "score": -1}, {"body": "Probably so pro life people can jerk themselves off and say stupid shit like\n\n>GoOd At LeAsT tHey HaVe a ShOt\n\nWhile forgetting about the fact that these babies are now wards of the state and will likely lead a brutal life.", "author_name": "urgoingdownbitch01", "utc": 1549296351.0, "replies": [["urgoingdownbitch01", "Flincher14"], ["urgoingdownbitch01", "mechl"]], "parent": "WeAreGonnaBang", "score": -12}, {"body": "Ah well babies tend to get adopted asap. I dont expect a life of foster care for them ", "author_name": "Flincher14", "utc": 1549297290.0, "replies": [["Flincher14", "urgoingdownbitch01"]], "parent": "urgoingdownbitch01", "score": 7}, {"body": "That must be very reassuring to the babies  anonymous Reddit person with no stakes in the situation. ", "author_name": "urgoingdownbitch01", "utc": 1549333693.0, "replies": null, "parent": "Flincher14", "score": 0}, {"body": "Except that there's a long waiting list for babies and they get adopted quickly. It's older kids that have a harder time.", "author_name": "mechl", "utc": 1549304611.0, "replies": null, "parent": "urgoingdownbitch01", "score": 1}, {"body": "Good for her. Taking care of one baby is tough, twins is a whole other level of difficult for a very long time. Hope those kids go to a good home, hopefully someone will raise them together.", "author_name": "SlowYerRoll1", "utc": 1549313330.0, "replies": null, "parent": null, "score": 5}, {"body": "Do they try to contact the father in these cases?", "author_name": "0b0011", "utc": 1549280588.0, "replies": [["0b0011", "effieokay"], ["0b0011", "Rosebunse"], ["0b0011", "Noraart"], ["0b0011", "failingconstantly"]], "parent": null, "score": 21}, {"body": "Yes. An extensive effort will be made. ", "author_name": "effieokay", "utc": 1549281481.0, "replies": [["effieokay", "istayquiet"], ["effieokay", "0b0011"]], "parent": "0b0011", "score": 20}, {"body": "Actually, there are not \"extensive\" efforts made to contact the father. Because safe-haven surrenders are anonymous (by design), there is no way to obtain the name of the woman who surrenders a child/children in this manner. This prevents foster care agencies from conducting true searches for fathers in these circumstances. They can do things like publish notices in newspapers about the physical features of the woman that surrendered the baby, etc, but there isn't much more to connect the baby to the father (who may not know about the pregnancy). \n\nThis is why adoption can be a better option than safe haven. If a woman does a safe-haven placement (like the one in this article), it's done completely anonymously, which means there will be no way for her or the child to contact one another if they decide they want to in the future. If she chooses adoption, she can decide on her own terms whether she wants openness and contact with the adoptive family, or wants to have that later in the child's life.  With safe-haven, the biological family of the child (father, birth relatives) are almost impossible to contact. With adoption, legal requirements ensure a REAL search is conducted to notify the father of the adoption plan, and give him reasonable time to contest it if he wants to parent.  This kind of search is overseen by a judge, who decides whether an adoption agency or attorney has \"done enough\" to locate the birth father during the notification period.  \n\nSource: I work for an adoption agency that trains hospitals in safe haven vs. adoption laws.  ", "author_name": "istayquiet", "utc": 1549290970.0, "replies": [["istayquiet", "ToplessNedFlanders"], ["istayquiet", "rubyywoo"]], "parent": "effieokay", "score": 35}, {"body": "> which means there will be no way for her or the child to contact one another if they decide they want to in the future.\n\nIn the article it states they gave her instruction on how to reclaim the children, using the law, if she changes her mind in the future.  This would require things to be non-anonymous, at the least \"tagged\".  ", "author_name": "ToplessNedFlanders", "utc": 1549291387.0, "replies": [["ToplessNedFlanders", "istayquiet"], ["ToplessNedFlanders", "Pseuzq"]], "parent": "istayquiet", "score": 24}, {"body": "Typically, safe haven surrender only allows a very short time frame for women to change their mind (if at all). Where I work, it is between 24-48 hours. \n\nWith adoption, it can be as long as 45 days after the birth of a child. \n\nJust because they provide women with instruction on how to revoke a safe haven placement does not mean they are anonymous. They are intentionally done with as few identifying factors as possible in order to encourage women to surrender infants instead of harming them or abandoning them in unsafe situations. These laws are absolutely not designed to make contacting a babys father easy, or to make conducting an extensive search possible. ", "author_name": "istayquiet", "utc": 1549294611.0, "replies": [["istayquiet", "ToplessNedFlanders"]], "parent": "ToplessNedFlanders", "score": 10}, {"body": "> Because safe-haven surrenders are anonymous \n\nI'm not trying to disagree with you or be pedantic - but you said originally they are anonymous, but later on that they are not in the 24-48 hour short term.\n\nI appreciate the work you do.  My only experience was in adopting a child, and it was already settled with his bio parents that there was to be no contact.  ", "author_name": "ToplessNedFlanders", "utc": 1549295834.0, "replies": [["ToplessNedFlanders", "WoolOfBat"], ["ToplessNedFlanders", "istayquiet"]], "parent": "istayquiet", "score": 3}, {"body": "You can be anonymous and still have identifying authentication. For example, when I drop a baby off I'm given a code that I need to present if I change my mind the next day. There's no PII, but I can still prove that the kid is mine since nobody else in the world should have the code tied to my child.", "author_name": "WoolOfBat", "utc": 1549303196.0, "replies": [["WoolOfBat", "ToplessNedFlanders"]], "parent": "ToplessNedFlanders", "score": 5}, {"body": "> should have the code \n\nThat scares me in a \"human trafficking with  plausible deniability\" mindset.  Sad outliers, though.\n\nOutside of that, and in a real world situation: I'm just glad people are feeling safe enough to use the services offered and I hope the babies are on better paths now.", "author_name": "ToplessNedFlanders", "utc": 1549303571.0, "replies": [["ToplessNedFlanders", "WoolOfBat"]], "parent": "WoolOfBat", "score": 2}, {"body": "> That scares me in a \"human trafficking with plausible deniability\" mindset. Sad outliers, though.\n\nI think that wouldn't be an issue, since it's extra risk for negative gain. If you're buying an unborn child, laundering it through a safe haven puts them on the government's radar, which can lead to patterns emerging and ultimately betray the human traffickers. It would be a lot easier to have an off the books birth, creating a stateless (and thus even more easily manipulated) child that only a handful of people on the take even know about.", "author_name": "WoolOfBat", "utc": 1549310609.0, "replies": null, "parent": "ToplessNedFlanders", "score": 3}, {"body": "Safe Haven surrenders are anonymous in the sense that once the revocation period expires, a woman has no rights to her child.  In many safe haven situations, once the revocation period expires, all parental rights are terminated (even the other parent who did not surrender the child). The child will never have rights to its birth identity (like the name of its mother or original birth certificate ). \n\nWith adoption, the birth parent(s) can choose the level of openness they are comfortable with, and this can change at any time. We have had parents decide they want a fully closed adoption and then 5 years later, decide they would like letters and pictures of their child as they grow. Adoption also allows a child access to their original birth certificate in many states. The other huge benefit of adoption is that a counselor can help to learn important medical background information about the childs biological family that would otherwise not be available in a safe have situation. Knowing about potential genetic conditions or prenatal exposures can make a big difference in how a child is raised. \n\nSafe haven surrender is not a bad thing. We just like to provide information about the realities of these laws and how they are intentionally designed. Babies surrendered through safe haven are almost never going to know about their biological families. ", "author_name": "istayquiet", "utc": 1549305422.0, "replies": null, "parent": "ToplessNedFlanders", "score": 1}, {"body": ">tagged\n\nHoly smokes, like a chip from SPCA or Fish & Game.", "author_name": "Pseuzq", "utc": 1549300853.0, "replies": null, "parent": "ToplessNedFlanders", "score": 0}, {"body": "This is a completely valid concern, and its something that is consistently addressed concerning these laws.  One potential solution is to require more stringent compulsion in requiring that mothers identify the biological father of their children at birth.  If this door is opened, though, everyone can go through it and I'm not sure that's something that everyone is going to want.  This would potentially require DNA testing with every birth and databases - a slippery slope for sure.\n\nIn *Prince v. Massachusetts,* however, the Court held that the state has a legitimate power to limit parental freedom in certain circumstances, specifically that society's interest in protecting the welfare of children is sometimes a valid reason to interfere with parents' rights.  Here, safe haven statutes likely pass the intermediate or rational basis \"with teeth\" test required by the Court to uphold laws that affect the sexes differently.  These statutes 1.) further an importantgovernment interest and 2.) likely do so bymeans that are substantially related to that interest.\n\nThis is certainly a big question in family law, and the question of strengthening the parental protection for unwed fathers is complicated.", "author_name": "rubyywoo", "utc": 1549300843.0, "replies": null, "parent": "istayquiet", "score": -1}, {"body": "Like DNA and what not? Otherwise it would miss people who don't know about the kid or don't think it's theirs.", "author_name": "0b0011", "utc": 1549287708.0, "replies": [["0b0011", "LIGHT_COLLUSION"]], "parent": "effieokay", "score": -4}, {"body": "And how would DNA help in that case? There is no national DNA database.\n\nWhat are the cops/CPS supposed to do, ask people to submit DNA if they think they might be the father?\n\n&#x200B;\n\nEdit: spelling a word", "author_name": "LIGHT_COLLUSION", "utc": 1549288172.0, "replies": [["LIGHT_COLLUSION", "effieokay"], ["LIGHT_COLLUSION", "0b0011"]], "parent": "0b0011", "score": 21}, {"body": "If someone feels they may be the father they can step forward and request DNA testing.  \n\nIn years of social work, I only had this happen once. He was determined to be the father but then he started messing around and dipped out. ", "author_name": "effieokay", "utc": 1549288640.0, "replies": [["effieokay", "LaserkidTW"]], "parent": "LIGHT_COLLUSION", "score": 15}, {"body": "If she surrendered the kids in the first place, he doesn't care or maybe even know.", "author_name": "LaserkidTW", "utc": 1549298669.0, "replies": null, "parent": "effieokay", "score": 2}, {"body": "Seeing all the articles on here recently about how easy it is for law enforcement to find people via DNA databases like 23 and me one would think that perhaps they'd be able to use something like that. Perhaps as simple as running the DNA and having it point out a relative as a match and then saying hey this may be the father's sister so maybe this is the father. I was mostly just curious about what sort of stuff they do to check.", "author_name": "0b0011", "utc": 1549292007.0, "replies": [["0b0011", "rubyywoo"]], "parent": "LIGHT_COLLUSION", "score": 1}, {"body": "It's not that its not possible, people are extremely resistant to government DNA databases and compulsory DNA testing.  Would the solution be to have every citizen DNA tested, and then DNA test every baby that is born and cross reference?  I'm not asking that in a sarcastic way, this is a problem and the solution isn't easy.  Government mandated DNA testing isn't going to be popular.", "author_name": "rubyywoo", "utc": 1549310593.0, "replies": [["rubyywoo", "0b0011"]], "parent": "0b0011", "score": 1}, {"body": "I'm not talking about a government mandated one. Killers have been caught by just throwing their DNA on a site like 23 and me and clicking \"show me my relatives\" I was saying they could do something like that with the baby and then find matches that way.", "author_name": "0b0011", "utc": 1549310943.0, "replies": [["0b0011", "rubyywoo"]], "parent": "rubyywoo", "score": 1}, {"body": "But legally, constitutionally, the government can't just do that.  They need to function within the legal parameters of our administrative and governmental laws and those private databases are not regulated by the state or a governing body.  They are incomplete and inconsistent.  It's not that its a bad idea, its just not legally sound.  ", "author_name": "rubyywoo", "utc": 1549311519.0, "replies": null, "parent": "0b0011", "score": 1}, {"body": "Maybe she doesn't trust the father or he's not in the picture?", "author_name": "Rosebunse", "utc": 1549292426.0, "replies": [["Rosebunse", "0b0011"]], "parent": "0b0011", "score": 8}, {"body": "That shouldn't matter in the slightest. A parents right to their child has nothing to do with if the other parent likes them or not.", "author_name": "0b0011", "utc": 1549293168.0, "replies": [["0b0011", "UrbanDryad"], ["0b0011", "tathougies"], ["0b0011", "Computermaster"], ["0b0011", "Adorable_Scallion"], ["0b0011", "Rosebunse"], ["0b0011", "meat_tunnel"]], "parent": "Rosebunse", "score": -8}, {"body": "No way to avoid this.  Safe haven laws are to prevent babies being dumped in places to die.  If you add *any* type of further restrictions it doesn't serve that purpose.  I'd call it a necessary evil. \n\nIt doesn't make it right, but the only thing you can do is be very careful who you sleep with.  You can be as careful as you like but no birth control is 100%.  If you care about your rights as a parent know that consenting to sex *always* presents a risk that you might be coparenting with this individual, a risk which includes Safe Haven being used.", "author_name": "UrbanDryad", "utc": 1549293790.0, "replies": [["UrbanDryad", "0b0011"]], "parent": "0b0011", "score": 25}, {"body": "By all means I'm not saying the rules should go away I just think that they should make efforts to track the parents to verify it wasn't something one wanted but the other didn't.", "author_name": "0b0011", "utc": 1549294546.0, "replies": [["0b0011", "UrbanDryad"]], "parent": "UrbanDryad", "score": 2}, {"body": "But how, without compromising the system and having us go back to \"babies in dumpsters\"?  \n\nLet's say this woman gave the kids up because she got knocked up by another guy and if she gets caught she's afraid of what will happen to her and the kids.  Or let's say dad is a hard core addict and she's legit afraid he'd sell them to sex traffickers for money.  (Unfortunately there are true stories of that happening.)  Any system that tracks down the father undoes the benefit of being anonymous.  And while I know these hypotheticals are not a common situation...dropping off your kids at a Fire Station isn't exactly common either.   I naturally assume shit has gone pretty sideways by the time this seems like a reasonable option for a new mother. ", "author_name": "UrbanDryad", "utc": 1549294927.0, "replies": [["UrbanDryad", "vanishplusxzone"], ["UrbanDryad", "par_texx"]], "parent": "0b0011", "score": 17}, {"body": "Right. *Or* she was raped, *or* she just escaped abuse, *or* she plain just doesn't know who the father is because she was fucking half the town, whatever.\n\nThere's a thousand and one \"or\"s here that don't need to come into play for \"what about the men\". *This isn't about the parents*.", "author_name": "vanishplusxzone", "utc": 1549295847.0, "replies": [["vanishplusxzone", "JennJayBee"]], "parent": "UrbanDryad", "score": 20}, {"body": "> This isn't about the parents.\n\nThank you. It bears repeating.", "author_name": "JennJayBee", "utc": 1549314029.0, "replies": null, "parent": "vanishplusxzone", "score": 4}, {"body": "> But how, without compromising the system and having us go back to \"babies in dumpsters\"?\n\nI don't know, but her right to make unilateral decisions about the child(ren) ended the instant she gave birth.  The father has no rights until the kid(s) is born, but the instant it comes out, he should have full and equal say in what happens to them.\n\nObviously short of a court order...", "author_name": "par_texx", "utc": 1549296739.0, "replies": [["par_texx", "UrbanDryad"], ["par_texx", "vanishplusxzone"]], "parent": "UrbanDryad", "score": -3}, {"body": "> I don't know\n\nI don't either, which is why I ruled this one a necessary evil.  When faced with two wrongs you pick the one that doesn't kill newborn babies over the one that violates an adult's rights.  ", "author_name": "UrbanDryad", "utc": 1549306530.0, "replies": [["UrbanDryad", "par_texx"]], "parent": "par_texx", "score": 5}, {"body": "Yeah, but it doesn't mean you stop the conversation, and you don't stop trying to find a better solution.  ", "author_name": "par_texx", "utc": 1549307452.0, "replies": [["par_texx", "rubyywoo"], ["par_texx", "UrbanDryad"]], "parent": "UrbanDryad", "score": 1}, {"body": "One of the reasons finding a solution to this is so difficult is that protection for unwed fathers is a jump from \"no protection\" to \"DNA tests.\"   Requiring greater compulsion of mothers' cooperation in identifying the father of their child is difficult and a slippery slope.  People are pretty resistant to government DNA databases and required testing.  It's certainly something that needs to be solved, but this is one reason why the problem is so difficult to navigate.  ", "author_name": "rubyywoo", "utc": 1549310452.0, "replies": null, "parent": "par_texx", "score": 1}, {"body": "Fine, but it does mean you keep the current system in place while you are looking.", "author_name": "UrbanDryad", "utc": 1549307788.0, "replies": null, "parent": "par_texx", "score": 1}, {"body": "Why do you think that the feelings of the father should matter more than the potential to keep the children safe?", "author_name": "vanishplusxzone", "utc": 1549297611.0, "replies": [["vanishplusxzone", "par_texx"], ["vanishplusxzone", "tathougies"], ["vanishplusxzone", "myalias1"]], "parent": "par_texx", "score": 5}, {"body": "It's his kid(s).  He should have full rights to his children, and should have the right to care for his children.  If she doesn't want them, he should have first right to his kids.  Neither parent should be able to surrender the children into the system without the others consent.  \n\nLets put it this way.  The scenario is the mother had a hard birth and needed to spend 3 days in the hospital.  Would you support the father having the right to take the newborn to the firehall and surrender them anonymously and without her consent?  If you don't support the father having that right, why would you support the mother having that right?  ", "author_name": "par_texx", "utc": 1549301077.0, "replies": [["par_texx", "rubyywoo"], ["par_texx", "JennJayBee"], ["par_texx", "UrbanDryad"]], "parent": "vanishplusxzone", "score": 0}, {"body": "Part of the problem in protecting unwed fathers is that to strengthen their protection would require greater compulsion of mothers' cooperation in identifying the father of their child.  But how can this be done?  Would this require compulsory DNA testing at birth to cross check with a database of all citizens DNA?  This seems like a jump, but it is part of the reality of this concern.  How can we require compulsion of mothers in identifying the father of their child at birth?", "author_name": "rubyywoo", "utc": 1549310904.0, "replies": null, "parent": "par_texx", "score": 3}, {"body": "The correct answer here is that the father's feelings on any subject do not matter more than the safety of the child. Ever. Any father arguing otherwise has just very helpfully answered the question as to whether or not he should be granted custody.", "author_name": "JennJayBee", "utc": 1549314319.0, "replies": null, "parent": "par_texx", "score": 1}, {"body": "> Would you support the father having the right to take the newborn to the firehall and surrender them anonymously and without her consent?\n\nYes, if the alternative to never allowing this is that somewhere, sometime a baby somewhere is going to die frozen in a dumpster.  And I could conceive of a few hypothetical situations in which Dad had a legitimate reason for doing that.  The problem is for the system to work we never get a chance to judge each case.  ", "author_name": "UrbanDryad", "utc": 1549306696.0, "replies": null, "parent": "par_texx", "score": -4}, {"body": "Because the state's duty is to the child, who fundamentally has a right to know both parents (per the international convention on rights of children). Perhaps one parent does not want that (and that is their right, too, I guess), but if the other does, then the state should make every effort to maintain that link.\n\nMoreover, if women are the only parents with unilateral rights of children, then it should come as no surprise when they are also viewed societally as the only parents with unilateral responsibilities. Is that the society you want to live in?", "author_name": "tathougies", "utc": 1549306225.0, "replies": null, "parent": "vanishplusxzone", "score": 1}, {"body": "It's not their feelings, it's their rights... parents have rights related to their offspring by default. Are you suggesting a parent's rights should come secondary to the presumption of a safety concern?", "author_name": "myalias1", "utc": 1549308166.0, "replies": [["myalias1", "rubyywoo"]], "parent": "vanishplusxzone", "score": -1}, {"body": "In *Prince v. Massachusetts* the Court held that the state has a legitimate power to limit parental freedom in certain circumstances, specifically that society's interest in protecting the welfare of children is sometimes a valid reason to interfere with parents' rights. Here, safe haven statutes likely pass the intermediate or rational basis \"with teeth\" test required by the Court to uphold laws that affect the sexes differently.  These statutes 1.) further an importantgovernment interest and 2.) likely do so bymeans that are substantially related to that interest.  I haven't done extensive research on it, if I'm wrong on the application.", "author_name": "rubyywoo", "utc": 1549310011.0, "replies": null, "parent": "myalias1", "score": 3}, {"body": "Not sure why you are being downvoted. If father's involvement with children is legally contingent on the 'approval' of the mother, then it should not surprise us that many children go fatherless or that mainly women are forced to choose between career and family. Ultimately, this would have the effect of making fathers second-class parents.", "author_name": "tathougies", "utc": 1549298636.0, "replies": [["tathougies", "vanishplusxzone"]], "parent": "0b0011", "score": 5}, {"body": "He is being downvoted because safe haven laws aren't about either of the parents, they are about keeping babies safe. Anonymity is part of that. \n\nHe, and you, are making it about the mother and the father when it is about the baby. ", "author_name": "vanishplusxzone", "utc": 1549300901.0, "replies": [["vanishplusxzone", "tathougies"]], "parent": "tathougies", "score": 8}, {"body": "I agree with you on the intent of infant surrender laws. However, that is not what the commenter he replied to claimed. In response to a question of whether the state will attempt to contact the father, the commenter that originally sparked this debate seemed to imply that, if the mother doesn't trust the father or he's 'not in the picture', that the state wouldn't or shouldn't contact him.\n\nWhile infant surrender laws without any qualification do allow parents who do not want to parent to safely give up their children in a controlled manner, that does not necessarily mean that fathers should not be contacted simply because the mother doesn't trust the father. Perhaps it should, perhaps it shouldn't. That question is neither here nor there, and I made no attempt to answer it. All I pointed out was that, if you claim that a father's right to be notified is contingent on the mother's approval, you inherently set up fathers as second-class parents (because a mother's right to give up the child was never questioned by anyone, presumably), and that, on a societal level, this arrangement could naturally lead to the current trends we see today where women are disproportionately impacted by the choice to have a child (because ultimately, it's all their choice, and the paternal involvement is simply a condition of the mother's tolerance). This is not a value judgement, and my comment above was not a recommendation on what to do. It is simply an observation, and an observation that I think many would find interesting, given the current issues of the day.", "author_name": "tathougies", "utc": 1549306126.0, "replies": null, "parent": "vanishplusxzone", "score": -2}, {"body": "> That shouldn't matter in the slightest. A parents right to their child has nothing to do with if the other parent likes them or not.\n\nThe other parent might be a rapist. ", "author_name": "Computermaster", "utc": 1549296979.0, "replies": [["Computermaster", "Bookandaglassofwine"], ["Computermaster", "SMTTT84"], ["Computermaster", "0b0011"]], "parent": "0b0011", "score": 4}, {"body": "Or ... he could be a good man.", "author_name": "Bookandaglassofwine", "utc": 1549297434.0, "replies": null, "parent": "Computermaster", "score": 4}, {"body": "The mother could be a bitch and giving the babies up out of spite.  ", "author_name": "SMTTT84", "utc": 1549303344.0, "replies": null, "parent": "Computermaster", "score": 4}, {"body": "In which case it shouldn't even come into question because a rapist should never be around a child.", "author_name": "0b0011", "utc": 1549298244.0, "replies": null, "parent": "Computermaster", "score": 1}, {"body": "So how do you start this investigation ", "author_name": "Adorable_Scallion", "utc": 1549305117.0, "replies": null, "parent": "0b0011", "score": 2}, {"body": "Well...\n\nAnd again, the father might not want them.", "author_name": "Rosebunse", "utc": 1549293487.0, "replies": [["Rosebunse", "0b0011"]], "parent": "0b0011", "score": 3}, {"body": "In which case he could just say no he's fine with her decision.", "author_name": "0b0011", "utc": 1549293650.0, "replies": null, "parent": "Rosebunse", "score": 4}, {"body": "Tell that to the dude who just got 60 years for raping and impregnating an 11 year old.", "author_name": "meat_tunnel", "utc": 1549306329.0, "replies": [["meat_tunnel", "Storm_cloud"], ["meat_tunnel", "0b0011"]], "parent": "0b0011", "score": -2}, {"body": "What does what you said have anything to do with that?\n\n>A parents right to their child has nothing to do with if the other parent likes them or not.\n\nis true.\n\nParental rights can and should be removed if the parent has done something wrong (e.g. abuse). But not merely if the other parent dislikes them. ", "author_name": "Storm_cloud", "utc": 1549309364.0, "replies": null, "parent": "meat_tunnel", "score": 1}, {"body": "That's a completely different situation. If the state deems the person not able to be there for parent that's one thing. I said it shouldn't rely on whether one parent likes the other not whether the state says you don't get to have the kid. Similarly if the parents get along but the state decides you still can't keep the kid you don't get them.", "author_name": "0b0011", "utc": 1549309393.0, "replies": null, "parent": "meat_tunnel", "score": 1}, {"body": "Look at the nose Maury look at the nose.", "author_name": "Noraart", "utc": 1549299797.0, "replies": null, "parent": "0b0011", "score": 2}, {"body": "They probably don't know who he is and I doubt the guy even knows he's a dad. ", "author_name": "failingconstantly", "utc": 1549291817.0, "replies": [["failingconstantly", "0b0011"]], "parent": "0b0011", "score": 4}, {"body": "That's why I replied to the other guys comment about DNA. I know we don't have any sort of national database but they've successfully used businesses databases to track criminals and what not. I've had family take DNA tests from several different companies and I've done one myself so if I had a kid I didn't know about it seems like they could just check one of them and track me down pretty easily to ask if I want the kid.", "author_name": "0b0011", "utc": 1549292253.0, "replies": null, "parent": "failingconstantly", "score": -1}, {"body": "Good for her. Way better than dumpster babies.", "author_name": "FR34KO", "utc": 1549312586.0, "replies": null, "parent": null, "score": 5}, {"body": "just drop them off in front of a pro-life clinic, they love babies.  or was it fetuses only?  I don't remember", "author_name": "pm_me_xayah_porn", "utc": 1549301806.0, "replies": null, "parent": null, "score": 2}, {"body": "Condoms may not feel great, but they definitely feel better than giving up your children because you can't raise them.", "author_name": "Maximillien", "utc": 1549302325.0, "replies": [["Maximillien", "SS_Upboat"]], "parent": null, "score": 3}, {"body": "Not everyone who gets pregnant a) consented to the sex, or b) failed to use contraception.", "author_name": "SS_Upboat", "utc": 1549307231.0, "replies": [["SS_Upboat", "Maximillien"]], "parent": "Maximillien", "score": 26}, {"body": "Great point, and of course I don't blame the victims of rape or faulty contraception. Just making the general comment since I'm always shocked at how unwanted pregnancies/children are so widespread in this day and age when there are so many ways to avoid it  the cases you mention being (hopefully) in the minority.", "author_name": "Maximillien", "utc": 1549312305.0, "replies": null, "parent": "SS_Upboat", "score": 3}, {"body": "Crazy how women have so many options to get off the hook for having kids but men are responsible in 99% of situations.", "author_name": "gohogs120", "utc": 1549321659.0, "replies": [["gohogs120", "iminatub"], ["gohogs120", "arnaq"], ["gohogs120", "fudgemonkees"]], "parent": null, "score": -2}, {"body": "Wait what ", "author_name": "iminatub", "utc": 1549327675.0, "replies": null, "parent": "gohogs120", "score": 4}, {"body": "Sounds like whatever man was involved got off the hook in this case...\n\nI didnt realize financially supporting your children was such a burden to men. Im guessing youre father of the year!", "author_name": "arnaq", "utc": 1549338723.0, "replies": null, "parent": "gohogs120", "score": 1}, {"body": "as long as you can make yourself the victim of something that has nothing to do with the subject at hand, that's all that matters.", "author_name": "fudgemonkees", "utc": 1549339609.0, "replies": null, "parent": "gohogs120", "score": 1}, {"body": "This could have been avoided with (presented sequentially):\n\n* Better sex education at her school and in her community\n\n* Easy access to contraception\n\n* Easy access to abortion.\n\nNow instead we'll have two kids who may never know who their mother is.\n\n", "author_name": "niton", "utc": 1549294295.0, "replies": [["niton", "Throwaway1303033042"], ["niton", "vanishplusxzone"], ["niton", "WhySheHateMe"], ["niton", "DragaliaBoy"], ["niton", "the_sammyd"], ["niton", "aithne1"], ["niton", "KingOfTheP4s"], ["niton", "boomermax"], ["niton", "Bookandaglassofwine"]], "parent": null, "score": -21}, {"body": "Nah, theyll probably know who their mother is.  They just may not know who birthed them.", "author_name": "Throwaway1303033042", "utc": 1549294916.0, "replies": null, "parent": "niton", "score": 27}, {"body": "I mean, you're right to an extent but adopted kids still have parents. These kids will have a better life being raised by someone who loves them. Family is more than DNA.", "author_name": "vanishplusxzone", "utc": 1549296065.0, "replies": null, "parent": "niton", "score": 21}, {"body": "You dont know this womans story. Her financial circumstances could have changed and shes unable to care for two newborns.", "author_name": "WhySheHateMe", "utc": 1549300957.0, "replies": null, "parent": "niton", "score": 5}, {"body": "Mental illness is an illness. ", "author_name": "DragaliaBoy", "utc": 1549304303.0, "replies": null, "parent": "niton", "score": 2}, {"body": "Better than them being dead, which I'm sure they would agree with 10 years from now ", "author_name": "the_sammyd", "utc": 1549297462.0, "replies": null, "parent": "niton", "score": 6}, {"body": "So fucking weird to hear this, considering that every adopted kid I know knows who their mother is. ", "author_name": "aithne1", "utc": 1549315841.0, "replies": null, "parent": "niton", "score": 2}, {"body": "Wow, you really went there?", "author_name": "KingOfTheP4s", "utc": 1549294985.0, "replies": null, "parent": "niton", "score": 1}, {"body": "(insert at the beginning)\n\nKeeping your legs closed. ", "author_name": "boomermax", "utc": 1549296454.0, "replies": [["boomermax", "throwaway101020403"]], "parent": "niton", "score": -24}, {"body": "Keep your dick in your pants unless its wrapped ", "author_name": "throwaway101020403", "utc": 1549298623.0, "replies": null, "parent": "boomermax", "score": 9}, {"body": "You forgot one:\n\n* Abstinence\n\n", "author_name": "Bookandaglassofwine", "utc": 1549297466.0, "replies": null, "parent": "niton", "score": -16}, {"body": "Wait a minute. Women can just decide not to be mothers and give up all responsibility? Why don't they force her against her will and threaten her with prison if she doesn't comply to pay for her children? You know, *for the good of the children*. Huh, guess only men need to be responsible for their actions.\n\nAmazing that there are people who will genuinely, unironically try to argue that women have no reproductive rights especially compared to men.", "author_name": "lucky_beast", "utc": 1549292615.0, "replies": [["lucky_beast", "UrbanDryad"], ["lucky_beast", "DriftingJesus"]], "parent": null, "score": -50}, {"body": "> Huh, guess only men need to be responsible for their actions.\n\nMen with full custody of the kids are also paid child support by the woman.  Child support is paid to the custodial parent so the children can be raised properly cared for.  This woman surrendered her children to be properly raised by an adoptive couple, so the good of the child is covered.\n\nReproductive rights are biased in favor of two factors: bodily autonomy and good of the children.  It's not a playground game.  It's real life.  Biology dictates that we can't make the system totally fair.  Women's biological rights *are* more restricted due to some of the more heavily regulated areas being things that can only pertain to women, i.e. many types of birth control, abortion, etc.  Hell, take surgical sterilization.  My husband got his vasectomy with no hassle.  Men can get one at 18 even if they have no kids.  If a woman wants their tubes tied many doctors won't let them unless they are over a certain age and/or and have already had children.  The reason given is that they might \"change their minds\".", "author_name": "UrbanDryad", "utc": 1549294553.0, "replies": null, "parent": "lucky_beast", "score": 30}, {"body": "What the fuck are you on about.  ", "author_name": "DriftingJesus", "utc": 1549293153.0, "replies": [["DriftingJesus", "Throwaway1303033042"], ["DriftingJesus", "meat_tunnel"]], "parent": "lucky_beast", "score": 31}, {"body": "Read their comment history and youll figure it out.", "author_name": "Throwaway1303033042", "utc": 1549293407.0, "replies": null, "parent": "DriftingJesus", "score": 18}, {"body": "mra is leaking", "author_name": "meat_tunnel", "utc": 1549302914.0, "replies": null, "parent": "DriftingJesus", "score": 9}, {"body": "Better then other options I guess", "author_name": "NotObviouslyARobot", "utc": 1549293826.0, "replies": null, "parent": null, "score": -8}, {"body": "Should still be on the hook for some amount of child support even if she doesn't raise them. Otherwise you and me are on the hook for it.", "author_name": "TrumpWonCryAboutIt", "utc": 1549308868.0, "replies": [["TrumpWonCryAboutIt", "blu3dice"], ["TrumpWonCryAboutIt", "dallasdarling"], ["TrumpWonCryAboutIt", "Stellaaahhhh"]], "parent": null, "score": -14}, {"body": "Newborn twins? There will probably be a waiting list of couple's wanting to adopt. \n", "author_name": "blu3dice", "utc": 1549312686.0, "replies": [["blu3dice", "TrumpWonCryAboutIt"]], "parent": "TrumpWonCryAboutIt", "score": 7}, {"body": "displacing another non-twin kid that would've been adopted instead, which costs us money still. logic hurts?", "author_name": "TrumpWonCryAboutIt", "utc": 1549312804.0, "replies": [["TrumpWonCryAboutIt", "blu3dice"]], "parent": "blu3dice", "score": -5}, {"body": "Adoption isn't an end-sum game. ", "author_name": "blu3dice", "utc": 1549317525.0, "replies": null, "parent": "TrumpWonCryAboutIt", "score": 4}, {"body": "If we do a good job they will be future tax payers and will pay us back. Investing in the future is always worth.", "author_name": "dallasdarling", "utc": 1549313062.0, "replies": [["dallasdarling", "TrumpWonCryAboutIt"]], "parent": "TrumpWonCryAboutIt", "score": 5}, {"body": "o right, overpopulation is good because its like printing money(which we know how good that turns out)", "author_name": "TrumpWonCryAboutIt", "utc": 1549313201.0, "replies": null, "parent": "dallasdarling", "score": -6}, {"body": "And I wanted my tax dollars to go to expanding the military. You mean to tell me they might use that money for social services? ", "author_name": "Stellaaahhhh", "utc": 1549313650.0, "replies": null, "parent": "TrumpWonCryAboutIt", "score": 1}, {"body": "Did I just read an article praising a woman for not murdering her babies?", "author_name": "Underwater_Karma", "utc": 1549302737.0, "replies": null, "parent": null, "score": -24}, {"body": "Should've had an abortion", "author_name": "Koebs", "utc": 1549297540.0, "replies": [["Koebs", "throwaway101020403"], ["Koebs", "MySweetBitch"]], "parent": null, "score": -21}, {"body": "Not everyone has access or means to do so. ", "author_name": "throwaway101020403", "utc": 1549298596.0, "replies": [["throwaway101020403", "boomermax"]], "parent": "Koebs", "score": 14}, {"body": "or the heart", "author_name": "boomermax", "utc": 1549299246.0, "replies": null, "parent": "throwaway101020403", "score": 1}, {"body": "You're not doing the pro choice movement any favors with comments like this ", "author_name": "MySweetBitch", "utc": 1549300917.0, "replies": [["MySweetBitch", "Koebs"]], "parent": "Koebs", "score": 13}, {"body": "How is that", "author_name": "Koebs", "utc": 1549301916.0, "replies": [["Koebs", "MySweetBitch"]], "parent": "MySweetBitch", "score": -11}, {"body": "Have you tried figuring out why for yourself?  Do you really need people to explain to you why telling women they should have had abortions is a problem?  ", "author_name": "MySweetBitch", "utc": 1549303387.0, "replies": [["MySweetBitch", "fantasticcow"]], "parent": "Koebs", "score": 6}, {"body": "Is it really so absurd when your alternative is abandoning your kids at the fucking fire station?", "author_name": "fantasticcow", "utc": 1549313475.0, "replies": null, "parent": "MySweetBitch", "score": -3}, {"body": "Why is this news?", "author_name": "notickeynoworky", "utc": 1549294016.0, "replies": [["notickeynoworky", "WalkerBRiley"], ["notickeynoworky", "regular6drunk7"]], "parent": null, "score": -14}, {"body": "Two reasons:\n\n1)  To promote the Safe-Surrender option as a very very VERY good and moral alternative to abandonment.\n\n2)  To educate people that there are multiple options to ensure the safety of children.", "author_name": "WalkerBRiley", "utc": 1549295894.0, "replies": [["WalkerBRiley", "Bookandaglassofwine"]], "parent": "notickeynoworky", "score": 18}, {"body": "So the purpose of News is to mold our opinions, not to just tell us impartially what is going on in the world?  Because that's what your answer sounds like to me, and I'm guessing you're okay with that.", "author_name": "Bookandaglassofwine", "utc": 1549297554.0, "replies": [["Bookandaglassofwine", "NyelloNandee"], ["Bookandaglassofwine", "aithne1"]], "parent": "WalkerBRiley", "score": -9}, {"body": "If someone sees this and they learn about the safe surrender option and how to go about it then yes. If your opinion has to be molded when it comes to safe surrender or leaving a child in a dumpster then theres something wrong with you. \n\nThis is simple morality. You should be looking at this and be immediately aware of the fact that safe surrender is better than child abandonment. ", "author_name": "NyelloNandee", "utc": 1549301587.0, "replies": [["NyelloNandee", "Bookandaglassofwine"]], "parent": "Bookandaglassofwine", "score": 8}, {"body": "So we depend on the news to instruct people in morality?  And you don't see the potential downside to that?", "author_name": "Bookandaglassofwine", "utc": 1549301689.0, "replies": [["Bookandaglassofwine", "JimLeader"]], "parent": "NyelloNandee", "score": -3}, {"body": "Again, no. Nobody's being \"instructed\" by this news; they're being educated and informed about the existence of the Safe Surrender option. They're assuming that everyone who sees that will understand intuitively that it's a good thing. This isn't an issue that has several different sides; it's more like when the weatherman finishes a segment about a cold snap by telling viewers that the local homeless shelter is holding an emergency blanket drive. There's no \"potential downside\" to the news giving people a heads-up about the existence of something good, useful, and potentially life-saving.", "author_name": "JimLeader", "utc": 1549312897.0, "replies": null, "parent": "Bookandaglassofwine", "score": 3}, {"body": "They're informing the public about a service by presenting a case study in which it was used. Not sure why you're so butthurt about it that you've posted this comment multiple times. ", "author_name": "aithne1", "utc": 1549315785.0, "replies": [["aithne1", "Bookandaglassofwine"]], "parent": "Bookandaglassofwine", "score": 5}, {"body": "Nothing convinces me like an argument that uses \"butthurt\".", "author_name": "Bookandaglassofwine", "utc": 1549315942.0, "replies": [["Bookandaglassofwine", "aithne1"]], "parent": "aithne1", "score": -2}, {"body": "Judging by your comments here, I don't think truth  plays well with you regardless of how it's phrased. ", "author_name": "aithne1", "utc": 1549316113.0, "replies": [["aithne1", "Bookandaglassofwine"]], "parent": "Bookandaglassofwine", "score": 2}, {"body": "What did you say that is truth, or what did I say that was a lie?  Truth isnt the issue in this discussion, the issue is the propriety of the news media trying to shape opinion through PSAs.  Its  a matter of opinion, not a matter of empirical truthfulness or falsehood.", "author_name": "Bookandaglassofwine", "utc": 1549316330.0, "replies": [["Bookandaglassofwine", "aithne1"]], "parent": "aithne1", "score": 1}, {"body": "I said that the news informed the public about a service by showing a case in which that service was used. Is it an opinion that the public was informed? Is it an opinion that this service was used? Here are some more facts: community leaders praised the use of the service. That's not a guess or opinion, that's a fact based on the statements they gave. You have an opinion about the newspaper's motivations in reporting this local news, but your opinion of *why* they did it shouldn't be confused with the facts of *what* they did.", "author_name": "aithne1", "utc": 1549316699.0, "replies": null, "parent": "Bookandaglassofwine", "score": 3}, {"body": "Why downvote this question? Downvoting is for comments that don't add to the discussion. I am pretty sure that there are a lot of people who don't know the answer to \"why is this news?\". Once they read the replies they start to understand why having a safe place to surrender a child you aren't equipped to handle is such a good idea.", "author_name": "regular6drunk7", "utc": 1549298677.0, "replies": null, "parent": "notickeynoworky", "score": -3}]