[{"body": ">Pollard slipped through a gap in the roadway\n\nI'm sorry, what?! Why is there a human sized gap in the roadway?", "author_name": "MeCJay12", "utc": 1546885892.0, "replies": [["MeCJay12", "dghah"], ["MeCJay12", "Dominicmeoward"], ["MeCJay12", "jaderust"], ["MeCJay12", "yukpurtsun"]], "parent": null, "score": 68}, {"body": "From a different writeup \"*...Steven Pollard, 30, a probationary firefighter with Ladder Company 170, was attempting to reach the victims on foot  and was crossing over from the eastbound lanes to the westbound lanes, where their vehicle was  when he fell to the ground below.*\n\n*Fire officials said Pollard plunged 52 feet as he tried to traverse a gap in the road. Its unclear, though, if he knew the gap was there when he tried to go across. The Mill Basin bridge was recently rebuilt, and now features a 2- to 3-foot-wide space between each side of the highway*\"\n\n&#x200B;\n\nFirefighters get crazy specific training and often tour/visit specific locations that are likely to generate future calls or require special techniques; I'm guessing as a probationary firefighter maybe they did not yet train on specific bridge-response stuff or something. Tragic all around. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;", "author_name": "dghah", "utc": 1546886216.0, "replies": [["dghah", "johnny956"], ["dghah", "va_wanderer"], ["dghah", "NectarCollecting"]], "parent": "MeCJay12", "score": 79}, {"body": "This just happened to a probationary police officer in St. Louis (actually he from was the Illinois side) and he was chasing a suspect on foot who crashed on a bridge, tried to jump the median and fell 50+ feet down", "author_name": "johnny956", "utc": 1546895891.0, "replies": [["johnny956", "gorgewall"]], "parent": "dghah", "score": 16}, {"body": "I'd say maybe we need to put a grate across these things but that might lead to more people hopping them thinking they can make it.", "author_name": "gorgewall", "utc": 1546908497.0, "replies": null, "parent": "johnny956", "score": 1}, {"body": "This is actually quite likely. I get groups of firefighters/paramedics who regularly get taken on tours through the transit stations I work in, and that's precisely why. Bridges are frequently on that list as well.", "author_name": "va_wanderer", "utc": 1546895162.0, "replies": null, "parent": "dghah", "score": 20}, {"body": "Not too long ago there were two similar instances of people doing this. One was a nurse who was in traffic on the other side, and she leaped out of her car and ran over to help, and I guess she thought she could make the gap?, she fell very far,\nBut survived. \n\nJust a few weeks ago there was a collision involving some semis and the guy survived but ended up falling down off the freeway. It was actually flush with the ground for a period of time, but then it dropped off andbhe probably didnt realize it. So he survived the crash and died anyways...", "author_name": "NectarCollecting", "utc": 1546906873.0, "replies": null, "parent": "dghah", "score": 1}, {"body": "Its a divided highway going over an overpass and he didnt realize when he was jumping to the other side that there was a gap, or that it was an overpass, so he fell through and it was about 50 feet down. ", "author_name": "Dominicmeoward", "utc": 1546886374.0, "replies": [["Dominicmeoward", "Comassion"], ["Dominicmeoward", "CousinBratwurst"], ["Dominicmeoward", "Robotwizard10k"], ["Dominicmeoward", "flashmozzg"]], "parent": "MeCJay12", "score": 26}, {"body": "Gah, talk about an unpleasant surprise.", "author_name": "Comassion", "utc": 1546889760.0, "replies": null, "parent": "Dominicmeoward", "score": 11}, {"body": "Same thing happened to a Shock Trauma nurse in Maryland two years ago.\n\nhttps://wtop.com/frederick-county/2016/08/nurse-who-fell-off-i-70-bridge-recalls-ordeal/", "author_name": "CousinBratwurst", "utc": 1546887803.0, "replies": [["CousinBratwurst", "Jonnydoo"]], "parent": "Dominicmeoward", "score": 12}, {"body": "holy shit she fell 75 feet into water. ", "author_name": "Jonnydoo", "utc": 1546889036.0, "replies": null, "parent": "CousinBratwurst", "score": 7}, {"body": "Also a probi firefighter might overestimate how far he can jump with all his gear on", "author_name": "Robotwizard10k", "utc": 1546908966.0, "replies": null, "parent": "Dominicmeoward", "score": 2}, {"body": "Is it hard to have even some basic stuff covering the gap? I.e. hard enough to not be worth it? Or as an alternative - if there is a gap, to have unjumpable dividers.", "author_name": "flashmozzg", "utc": 1546907736.0, "replies": null, "parent": "Dominicmeoward", "score": 1}, {"body": "I think its probably easier if you think of the overpass as two separate bridges, each for one direction of traffic with a gap of about three feet between the two. The poor dude didnt recognize that and fell between the two bridges. ", "author_name": "jaderust", "utc": 1546891864.0, "replies": null, "parent": "MeCJay12", "score": 11}, {"body": "Its two different roads really close to each other, one going in each direction. Theyre not connected im guessing he tried to jump across", "author_name": "yukpurtsun", "utc": 1546912429.0, "replies": null, "parent": "MeCJay12", "score": 1}, {"body": "Damn. One terrible lapse in judgement, probably thinking through adrenaline, and leaped over a hole he didnt know was there without looking first. Sheesh. \n\nF", "author_name": "King_Rhymer", "utc": 1546904135.0, "replies": [["King_Rhymer", "try_sarah_topps"]], "parent": null, "score": 4}, {"body": "They said it was dark. I'm guessing he had no reason to suspect there might be \"holes\" like that to watch out for", "author_name": "try_sarah_topps", "utc": 1546907331.0, "replies": null, "parent": "King_Rhymer", "score": 4}, {"body": "If our roads were better lit, he might've seen the drop. Being cheap on infrastructure gets first responders killed. Just ask the Mayor of 9/11, Ghouliani.", "author_name": "BERNthisMuthaDown", "utc": 1546889546.0, "replies": null, "parent": null, "score": -13}]