[{"body": "Important, Rohyingya are *not* Bangladeshi, and deporting them to Bangladesh is basically saying that what the Burmese/Myanmarese government is doing is okay, since the genocide being carried out by the Burmese/Myanmarese government is based on the lie that Rohingya muslims are actually Bangladeshis. This just creates even more stateless people.", "author_name": "throwawaynumber53", "utc": 1546870818.0, "replies": [["throwawaynumber53", "NineteenSkylines"]], "parent": null, "score": 28}, {"body": "Bangladesh doesn't recognize them as their citizens and in some cases has deported them back to Myanmar. ", "author_name": "NineteenSkylines", "utc": 1546884501.0, "replies": [["NineteenSkylines", "RENOYES"]], "parent": "throwawaynumber53", "score": 7}, {"body": "Can someone explain to me why this is happening to the Rohyingya? Is it like an old clan war or religious thing or do they want their land? Is it like the troubles where is was a combination of reasons?", "author_name": "RENOYES", "utc": 1546889560.0, "replies": [["RENOYES", "NineteenSkylines"]], "parent": "NineteenSkylines", "score": 1}, {"body": "Myanmar and Bangladesh were both part of the British Raj, and people moved back and forth, with a lot of Bangla Muslims moving to what's now Burmese territory. When the British left and the Burmese gained independence, thousands of Muslim people found themselves on the wrong side of the border with neither country claiming them. ", "author_name": "NineteenSkylines", "utc": 1546889923.0, "replies": [["NineteenSkylines", "RENOYES"]], "parent": "RENOYES", "score": 5}, {"body": "So it is a little like when the British made Israel out of this air? There is a cultural/religious issue mixed in with displaced people?\n\nEdit: or is it more like the India/Pakistan problem? Where the British just made an arbitrary border?", "author_name": "RENOYES", "utc": 1546890309.0, "replies": null, "parent": "NineteenSkylines", "score": 7}, {"body": "Probably the same with the UAE, Qatar, Oman, and Bahrain. ", "author_name": "Matty_BohU", "utc": 1546866914.0, "replies": null, "parent": null, "score": 5}, {"body": "Isnt that where they are from?", "author_name": "Mr_Tegridy", "utc": 1546879510.0, "replies": [["Mr_Tegridy", "Rosebunse"], ["Mr_Tegridy", "MyMorningSun"]], "parent": null, "score": -4}, {"body": "No, no it isn't.", "author_name": "Rosebunse", "utc": 1546879642.0, "replies": null, "parent": "Mr_Tegridy", "score": 8}, {"body": "No, and even if it were, there's a genocide against them occurring- having them sent back is the last thing that should be done. ", "author_name": "MyMorningSun", "utc": 1546887027.0, "replies": null, "parent": "Mr_Tegridy", "score": 1}]